AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
/******************************************************************************
 * ETHERNET_MAC_MODULE
 ******************************************************************************/
/* ETHERNET_MAC_MODULE register bit fields */
typedef struct stc_ethernet_mac_mcr_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t RE         : 1;
  __IO uint32_t TE         : 1;
  __IO uint32_t DC         : 1;
  __IO uint32_t BL0        : 1;
  __IO uint32_t BL1        : 1;
  __IO uint32_t ACS        : 1;
  __IO uint32_t LUD        : 1;
  __IO uint32_t DR         : 1;
  __IO uint32_t IPC        : 1;
  __IO uint32_t DM         : 1;
  __IO uint32_t LM         : 1;
  __IO uint32_t DO         : 1;
  __IO uint32_t FES        : 1;
  __IO uint32_t PS         : 1;
  __IO uint32_t DCRS       : 1;
  __IO uint32_t IFG0       : 1;
  __IO uint32_t IFG1       : 1;
  __IO uint32_t IFG2       : 1;
  __IO uint32_t JE         : 1;
  __IO uint32_t BE         : 1;
  __IO uint32_t JD         : 1;
  __IO uint32_t WD         : 1;
  __IO uint32_t TC         : 1;
  __IO uint32_t CST        : 1;
} stc_ethernet_mac_mcr_field_t;

typedef struct stc_ethernet_mac_mffr_field
{
  __IO uint32_t PR         : 1;
  __IO uint32_t HUC        : 1;
  __IO uint32_t HMC        : 1;
  __IO uint32_t DAIF       : 1;
  __IO uint32_t PM         : 1;
  __IO uint32_t DB         : 1;
  __IO uint32_t PCF0       : 1;
  __IO uint32_t PCF1       : 1;
  __IO uint32_t SAIF       : 1;
  __IO uint32_t SAF        : 1;
  __IO uint32_t HPF        : 1;
       uint32_t RESERVED1  :20;
  __IO uint32_t RA         : 1;
} stc_ethernet_mac_mffr_field_t;

typedef struct stc_ethernet_mac_mhtrh_field
{
  __IO uint32_t HTH0       : 1;
  __IO uint32_t HTH1       : 1;
  __IO uint32_t HTH2       : 1;
  __IO uint32_t HTH3       : 1;
  __IO uint32_t HTH4       : 1;
  __IO uint32_t HTH5       : 1;
  __IO uint32_t HTH6       : 1;
  __IO uint32_t HTH7       : 1;
  __IO uint32_t HTH8       : 1;
  __IO uint32_t HTH9       : 1;
  __IO uint32_t HTH10      : 1;
  __IO uint32_t HTH11      : 1;
  __IO uint32_t HTH12      : 1;
  __IO uint32_t HTH13      : 1;
  __IO uint32_t HTH14      : 1;
  __IO uint32_t HTH15      : 1;
  __IO uint32_t HTH16      : 1;
  __IO uint32_t HTH17      : 1;
  __IO uint32_t HTH18      : 1;
  __IO uint32_t HTH19      : 1;
  __IO uint32_t HTH20      : 1;
  __IO uint32_t HTH21      : 1;
  __IO uint32_t HTH22      : 1;
  __IO uint32_t HTH23      : 1;
  __IO uint32_t HTH24      : 1;
  __IO uint32_t HTH25      : 1;
  __IO uint32_t HTH26      : 1;
  __IO uint32_t HTH27      : 1;
  __IO uint32_t HTH28      : 1;
  __IO uint32_t HTH29      : 1;
  __IO uint32_t HTH30      : 1;
  __IO uint32_t HTH31      : 1;
} stc_ethernet_mac_mhtrh_field_t;

typedef struct stc_ethernet_mac_mhtrl_field
{
  __IO uint32_t HTL0       : 1;
  __IO uint32_t HTL1       : 1;
  __IO uint32_t HTL2       : 1;
  __IO uint32_t HTL3       : 1;
  __IO uint32_t HTL4       : 1;
  __IO uint32_t HTL5       : 1;
  __IO uint32_t HTL6       : 1;
  __IO uint32_t HTL7       : 1;
  __IO uint32_t HTL8       : 1;
  __IO uint32_t HTL9       : 1;
  __IO uint32_t HTL10      : 1;
  __IO uint32_t HTL11      : 1;
  __IO uint32_t HTL12      : 1;
  __IO uint32_t HTL13      : 1;
  __IO uint32_t HTL14      : 1;
  __IO uint32_t HTL15      : 1;
  __IO uint32_t HTL16      : 1;
  __IO uint32_t HTL17      : 1;
  __IO uint32_t HTL18      : 1;
  __IO uint32_t HTL19      : 1;
  __IO uint32_t HTL20      : 1;
  __IO uint32_t HTL21      : 1;
  __IO uint32_t HTL22      : 1;
  __IO uint32_t HTL23      : 1;
  __IO uint32_t HTL24      : 1;
  __IO uint32_t HTL25      : 1;
  __IO uint32_t HTL26      : 1;
  __IO uint32_t HTL27      : 1;
  __IO uint32_t HTL28      : 1;
  __IO uint32_t HTL29      : 1;
  __IO uint32_t HTL30      : 1;
  __IO uint32_t HTL31      : 1;
} stc_ethernet_mac_mhtrl_field_t;

typedef struct stc_ethernet_mac_gar_field
{
  __IO uint32_t GB         : 1;
  __IO uint32_t GW         : 1;
  __IO uint32_t CR0        : 1;
  __IO uint32_t CR1        : 1;
  __IO uint32_t CR2        : 1;
  __IO uint32_t CR3        : 1;
  __IO uint32_t GR0        : 1;
  __IO uint32_t GR1        : 1;
  __IO uint32_t GR2        : 1;
  __IO uint32_t GR3        : 1;
  __IO uint32_t GR4        : 1;
  __IO uint32_t PA0        : 1;
  __IO uint32_t PA1        : 1;
  __IO uint32_t PA2        : 1;
  __IO uint32_t PA3        : 1;
  __IO uint32_t PA4        : 1;
} stc_ethernet_mac_gar_field_t;

typedef struct stc_ethernet_mac_gdr_field
{
  __IO uint32_t GD0        : 1;
  __IO uint32_t GD1        : 1;
  __IO uint32_t GD2        : 1;
  __IO uint32_t GD3        : 1;
  __IO uint32_t GD4        : 1;
  __IO uint32_t GD5        : 1;
  __IO uint32_t GD6        : 1;
  __IO uint32_t GD7        : 1;
  __IO uint32_t GD8        : 1;
  __IO uint32_t GD9        : 1;
  __IO uint32_t GD10       : 1;
  __IO uint32_t GD11       : 1;
  __IO uint32_t GD12       : 1;
  __IO uint32_t GD13       : 1;
  __IO uint32_t GD14       : 1;
  __IO uint32_t GD15       : 1;
} stc_ethernet_mac_gdr_field_t;

typedef struct stc_ethernet_mac_fcr_field
{
  __IO uint32_t FCB_BPA    : 1;
  __IO uint32_t TFE        : 1;
  __IO uint32_t RFE        : 1;
  __IO uint32_t UP         : 1;
  __IO uint32_t PLT0       : 1;
  __IO uint32_t PLT1       : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t DZPQ       : 1;
       uint32_t RESERVED2  : 8;
  __IO uint32_t PT0        : 1;
  __IO uint32_t PT1        : 1;
  __IO uint32_t PT2        : 1;
  __IO uint32_t PT3        : 1;
  __IO uint32_t PT4        : 1;
  __IO uint32_t PT5        : 1;
  __IO uint32_t PT6        : 1;
  __IO uint32_t PT7        : 1;
  __IO uint32_t PT8        : 1;
  __IO uint32_t PT9        : 1;
  __IO uint32_t PT10       : 1;
  __IO uint32_t PT11       : 1;
  __IO uint32_t PT12       : 1;
  __IO uint32_t PT13       : 1;
  __IO uint32_t PT14       : 1;
  __IO uint32_t PT15       : 1;
} stc_ethernet_mac_fcr_field_t;

typedef struct stc_ethernet_mac_vtr_field
{
  __IO uint32_t VL0        : 1;
  __IO uint32_t VL1        : 1;
  __IO uint32_t VL2        : 1;
  __IO uint32_t VL3        : 1;
  __IO uint32_t VL4        : 1;
  __IO uint32_t VL5        : 1;
  __IO uint32_t VL6        : 1;
  __IO uint32_t VL7        : 1;
  __IO uint32_t VL8        : 1;
  __IO uint32_t VL9        : 1;
  __IO uint32_t VL10       : 1;
  __IO uint32_t VL11       : 1;
  __IO uint32_t VL12       : 1;
  __IO uint32_t VL13       : 1;
  __IO uint32_t VL14       : 1;
  __IO uint32_t VL15       : 1;
  __IO uint32_t ETV        : 1;
} stc_ethernet_mac_vtr_field_t;

typedef struct stc_ethernet_mac_rwffr_field
{
  __IO uint32_t RWFFR0     : 1;
  __IO uint32_t RWFFR1     : 1;
  __IO uint32_t RWFFR2     : 1;
  __IO uint32_t RWFFR3     : 1;
  __IO uint32_t RWFFR4     : 1;
  __IO uint32_t RWFFR5     : 1;
  __IO uint32_t RWFFR6     : 1;
  __IO uint32_t RWFFR7     : 1;
  __IO uint32_t RWFFR8     : 1;
  __IO uint32_t RWFFR9     : 1;
  __IO uint32_t RWFFR10    : 1;
  __IO uint32_t RWFFR11    : 1;
  __IO uint32_t RWFFR12    : 1;
  __IO uint32_t RWFFR13    : 1;
  __IO uint32_t RWFFR14    : 1;
  __IO uint32_t RWFFR15    : 1;
  __IO uint32_t RWFFR16    : 1;
  __IO uint32_t RWFFR17    : 1;
  __IO uint32_t RWFFR18    : 1;
  __IO uint32_t RWFFR19    : 1;
  __IO uint32_t RWFFR20    : 1;
  __IO uint32_t RWFFR21    : 1;
  __IO uint32_t RWFFR22    : 1;
  __IO uint32_t RWFFR23    : 1;
  __IO uint32_t RWFFR24    : 1;
  __IO uint32_t RWFFR25    : 1;
  __IO uint32_t RWFFR26    : 1;
  __IO uint32_t RWFFR27    : 1;
  __IO uint32_t RWFFR28    : 1;
  __IO uint32_t RWFFR29    : 1;
  __IO uint32_t RWFFR30    : 1;
  __IO uint32_t RWFFR31    : 1;
} stc_ethernet_mac_rwffr_field_t;

typedef struct stc_ethernet_mac_pmtr_field
{
  __IO uint32_t PD         : 1;
  __IO uint32_t MPE        : 1;
  __IO uint32_t WFE        : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t MPR        : 1;
  __IO uint32_t WPR        : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t GU         : 1;
       uint32_t RESERVED3  :21;
  __IO uint32_t RWFFRPR    : 1;
} stc_ethernet_mac_pmtr_field_t;

typedef struct stc_ethernet_mac_lpicsr_field
{
  __IO uint32_t TLPIEN     : 1;
  __IO uint32_t TLPIEX     : 1;
  __IO uint32_t RLPIEN     : 1;
  __IO uint32_t RLPIEX     : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t TLPIST     : 1;
  __IO uint32_t RLPIST     : 1;
       uint32_t RESERVED2  : 6;
  __IO uint32_t LPIEN      : 1;
  __IO uint32_t PLS        : 1;
  __IO uint32_t PLSEN      : 1;
  __IO uint32_t LPITXA     : 1;
} stc_ethernet_mac_lpicsr_field_t;

typedef struct stc_ethernet_mac_lpitcr_field
{
  __IO uint32_t TWT0       : 1;
  __IO uint32_t TWT1       : 1;
  __IO uint32_t TWT2       : 1;
  __IO uint32_t TWT3       : 1;
  __IO uint32_t TWT4       : 1;
  __IO uint32_t TWT5       : 1;
  __IO uint32_t TWT6       : 1;
  __IO uint32_t TWT7       : 1;
  __IO uint32_t TWT8       : 1;
  __IO uint32_t TWT9       : 1;
  __IO uint32_t TWT10      : 1;
  __IO uint32_t TWT11      : 1;
  __IO uint32_t TWT12      : 1;
  __IO uint32_t TWT13      : 1;
  __IO uint32_t TWT14      : 1;
  __IO uint32_t TWT15      : 1;
  __IO uint32_t LIT0       : 1;
  __IO uint32_t LIT1       : 1;
  __IO uint32_t LIT2       : 1;
  __IO uint32_t LIT3       : 1;
  __IO uint32_t LIT4       : 1;
  __IO uint32_t LIT5       : 1;
  __IO uint32_t LIT6       : 1;
  __IO uint32_t LIT7       : 1;
  __IO uint32_t LIT8       : 1;
  __IO uint32_t LIT9       : 1;
} stc_ethernet_mac_lpitcr_field_t;

typedef struct stc_ethernet_mac_isr_field
{
  __IO uint32_t RGIS       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t PIS        : 1;
  __IO uint32_t MIS        : 1;
  __IO uint32_t RIS        : 1;
  __IO uint32_t TIS        : 1;
  __IO uint32_t COIS       : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t TSIS       : 1;
  __IO uint32_t LPIIS      : 1;
} stc_ethernet_mac_isr_field_t;

typedef struct stc_ethernet_mac_imr_field
{
  __IO uint32_t RGIM       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t PIM        : 1;
       uint32_t RESERVED2  : 5;
  __IO uint32_t TSIM       : 1;
  __IO uint32_t LPIIM      : 1;
} stc_ethernet_mac_imr_field_t;

typedef struct stc_ethernet_mac_mar0h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  :15;
  __IO uint32_t MO         : 1;
} stc_ethernet_mac_mar0h_field_t;

typedef struct stc_ethernet_mac_mar0l_field
{
  __IO uint32_t A0         : 1;
  __IO uint32_t A1         : 1;
  __IO uint32_t A2         : 1;
  __IO uint32_t A3         : 1;
  __IO uint32_t A4         : 1;
  __IO uint32_t A5         : 1;
  __IO uint32_t A6         : 1;
  __IO uint32_t A7         : 1;
  __IO uint32_t A8         : 1;
  __IO uint32_t A9         : 1;
  __IO uint32_t A10        : 1;
  __IO uint32_t A11        : 1;
  __IO uint32_t A12        : 1;
  __IO uint32_t A13        : 1;
  __IO uint32_t A14        : 1;
  __IO uint32_t A15        : 1;
  __IO uint32_t A16        : 1;
  __IO uint32_t A17        : 1;
  __IO uint32_t A18        : 1;
  __IO uint32_t A19        : 1;
  __IO uint32_t A20        : 1;
  __IO uint32_t A21        : 1;
  __IO uint32_t A22        : 1;
  __IO uint32_t A23        : 1;
  __IO uint32_t A24        : 1;
  __IO uint32_t A25        : 1;
  __IO uint32_t A26        : 1;
  __IO uint32_t A27        : 1;
  __IO uint32_t A28        : 1;
  __IO uint32_t A29        : 1;
  __IO uint32_t A30        : 1;
  __IO uint32_t A31        : 1;
} stc_ethernet_mac_mar0l_field_t;

typedef struct stc_ethernet_mac_mar1h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC0       : 1;
  __IO uint32_t MBC1       : 1;
  __IO uint32_t MBC2       : 1;
  __IO uint32_t MBC3       : 1;
  __IO uint32_t MBC4       : 1;
  __IO uint32_t MBC5       : 1;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_mar1h_field_t;

