AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
typedef struct stc_ethernet_mac_mar31h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC0       : 1;
  __IO uint32_t MBC1       : 1;
  __IO uint32_t MBC2       : 1;
  __IO uint32_t MBC3       : 1;
  __IO uint32_t MBC4       : 1;
  __IO uint32_t MBC5       : 1;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_mar31h_field_t;

typedef struct stc_ethernet_mac_mar31l_field
{
  __IO uint32_t A0         : 1;
  __IO uint32_t A1         : 1;
  __IO uint32_t A2         : 1;
  __IO uint32_t A3         : 1;
  __IO uint32_t A4         : 1;
  __IO uint32_t A5         : 1;
  __IO uint32_t A6         : 1;
  __IO uint32_t A7         : 1;
  __IO uint32_t A8         : 1;
  __IO uint32_t A9         : 1;
  __IO uint32_t A10        : 1;
  __IO uint32_t A11        : 1;
  __IO uint32_t A12        : 1;
  __IO uint32_t A13        : 1;
  __IO uint32_t A14        : 1;
  __IO uint32_t A15        : 1;
  __IO uint32_t A16        : 1;
  __IO uint32_t A17        : 1;
  __IO uint32_t A18        : 1;
  __IO uint32_t A19        : 1;
  __IO uint32_t A20        : 1;
  __IO uint32_t A21        : 1;
  __IO uint32_t A22        : 1;
  __IO uint32_t A23        : 1;
  __IO uint32_t A24        : 1;
  __IO uint32_t A25        : 1;
  __IO uint32_t A26        : 1;
  __IO uint32_t A27        : 1;
  __IO uint32_t A28        : 1;
  __IO uint32_t A29        : 1;
  __IO uint32_t A30        : 1;
  __IO uint32_t A31        : 1;
} stc_ethernet_mac_mar31l_field_t;

typedef struct stc_ethernet_mac_bmr_field
{
  __IO uint32_t SWR        : 1;
  __IO uint32_t DA         : 1;
  __IO uint32_t DSL0       : 1;
  __IO uint32_t DSL1       : 1;
  __IO uint32_t DSL2       : 1;
  __IO uint32_t DSL3       : 1;
  __IO uint32_t DSL4       : 1;
  __IO uint32_t ATDS       : 1;
  __IO uint32_t PBL0       : 1;
  __IO uint32_t PBL1       : 1;
  __IO uint32_t PBL2       : 1;
  __IO uint32_t PBL3       : 1;
  __IO uint32_t PBL4       : 1;
  __IO uint32_t PBL5       : 1;
  __IO uint32_t PR0        : 1;
  __IO uint32_t PR1        : 1;
  __IO uint32_t FB         : 1;
  __IO uint32_t RPBL0      : 1;
  __IO uint32_t RPBL1      : 1;
  __IO uint32_t RPBL2      : 1;
  __IO uint32_t RPBL3      : 1;
  __IO uint32_t RPBL4      : 1;
  __IO uint32_t RPBL5      : 1;
  __IO uint32_t USP        : 1;
  __IO uint32_t _8XPBL     : 1;
  __IO uint32_t AAL        : 1;
  __IO uint32_t MB         : 1;
  __IO uint32_t TXPR       : 1;
} stc_ethernet_mac_bmr_field_t;

typedef struct stc_ethernet_mac_tpdr_field
{
  __IO uint32_t TPD0       : 1;
  __IO uint32_t TPD1       : 1;
  __IO uint32_t TPD2       : 1;
  __IO uint32_t TPD3       : 1;
  __IO uint32_t TPD4       : 1;
  __IO uint32_t TPD5       : 1;
  __IO uint32_t TPD6       : 1;
  __IO uint32_t TPD7       : 1;
  __IO uint32_t TPD8       : 1;
  __IO uint32_t TPD9       : 1;
  __IO uint32_t TPD10      : 1;
  __IO uint32_t TPD11      : 1;
  __IO uint32_t TPD12      : 1;
  __IO uint32_t TPD13      : 1;
  __IO uint32_t TPD14      : 1;
  __IO uint32_t TPD15      : 1;
  __IO uint32_t TPD16      : 1;
  __IO uint32_t TPD17      : 1;
  __IO uint32_t TPD18      : 1;
  __IO uint32_t TPD19      : 1;
  __IO uint32_t TPD20      : 1;
  __IO uint32_t TPD21      : 1;
  __IO uint32_t TPD22      : 1;
  __IO uint32_t TPD23      : 1;
  __IO uint32_t TPD24      : 1;
  __IO uint32_t TPD25      : 1;
  __IO uint32_t TPD26      : 1;
  __IO uint32_t TPD27      : 1;
  __IO uint32_t TPD28      : 1;
  __IO uint32_t TPD29      : 1;
  __IO uint32_t TPD30      : 1;
  __IO uint32_t TPD31      : 1;
} stc_ethernet_mac_tpdr_field_t;

typedef struct stc_ethernet_mac_rpdr_field
{
  __IO uint32_t RPD0       : 1;
  __IO uint32_t RPD1       : 1;
  __IO uint32_t RPD2       : 1;
  __IO uint32_t RPD3       : 1;
  __IO uint32_t RPD4       : 1;
  __IO uint32_t RPD5       : 1;
  __IO uint32_t RPD6       : 1;
  __IO uint32_t RPD7       : 1;
  __IO uint32_t RPD8       : 1;
  __IO uint32_t RPD9       : 1;
  __IO uint32_t RPD10      : 1;
  __IO uint32_t RPD11      : 1;
  __IO uint32_t RPD12      : 1;
  __IO uint32_t RPD13      : 1;
  __IO uint32_t RPD14      : 1;
  __IO uint32_t RPD15      : 1;
  __IO uint32_t RPD16      : 1;
  __IO uint32_t RPD17      : 1;
  __IO uint32_t RPD18      : 1;
  __IO uint32_t RPD19      : 1;
  __IO uint32_t RPD20      : 1;
  __IO uint32_t RPD21      : 1;
  __IO uint32_t RPD22      : 1;
  __IO uint32_t RPD23      : 1;
  __IO uint32_t RPD24      : 1;
  __IO uint32_t RPD25      : 1;
  __IO uint32_t RPD26      : 1;
  __IO uint32_t RPD27      : 1;
  __IO uint32_t RPD28      : 1;
  __IO uint32_t RPD29      : 1;
  __IO uint32_t RPD30      : 1;
  __IO uint32_t RPD31      : 1;
} stc_ethernet_mac_rpdr_field_t;

typedef struct stc_ethernet_mac_rdlar_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t SRL2       : 1;
  __IO uint32_t SRL3       : 1;
  __IO uint32_t SRL4       : 1;
  __IO uint32_t SRL5       : 1;
  __IO uint32_t SRL6       : 1;
  __IO uint32_t SRL7       : 1;
  __IO uint32_t SRL8       : 1;
  __IO uint32_t SRL9       : 1;
  __IO uint32_t SRL10      : 1;
  __IO uint32_t SRL11      : 1;
  __IO uint32_t SRL12      : 1;
  __IO uint32_t SRL13      : 1;
  __IO uint32_t SRL14      : 1;
  __IO uint32_t SRL15      : 1;
  __IO uint32_t SRL16      : 1;
  __IO uint32_t SRL17      : 1;
  __IO uint32_t SRL18      : 1;
  __IO uint32_t SRL19      : 1;
  __IO uint32_t SRL20      : 1;
  __IO uint32_t SRL21      : 1;
  __IO uint32_t SRL22      : 1;
  __IO uint32_t SRL23      : 1;
  __IO uint32_t SRL24      : 1;
  __IO uint32_t SRL25      : 1;
  __IO uint32_t SRL26      : 1;
  __IO uint32_t SRL27      : 1;
  __IO uint32_t SRL28      : 1;
  __IO uint32_t SRL29      : 1;
  __IO uint32_t SRL30      : 1;
  __IO uint32_t SRL31      : 1;
} stc_ethernet_mac_rdlar_field_t;

