AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
/******************************************************************************
 * DMAC_MODULE
 ******************************************************************************/
/* DMA controller */
typedef struct
{
  union {
    __IO uint32_t DMACR;
    stc_dmac_dmacr_field_t DMACR_f;
  };
        uint8_t RESERVED0[12];
  union {
    __IO uint32_t DMACA0;
    stc_dmac_dmaca0_field_t DMACA0_f;
  };
  union {
    __IO uint32_t DMACB0;
    stc_dmac_dmacb0_field_t DMACB0_f;
  };
  __IO uint32_t DMACSA0;
  __IO uint32_t DMACDA0;
  union {
    __IO uint32_t DMACA1;
    stc_dmac_dmaca1_field_t DMACA1_f;
  };
  union {
    __IO uint32_t DMACB1;
    stc_dmac_dmacb1_field_t DMACB1_f;
  };
  __IO uint32_t DMACSA1;
  __IO uint32_t DMACDA1;
  union {
    __IO uint32_t DMACA2;
    stc_dmac_dmaca2_field_t DMACA2_f;
  };
  union {
    __IO uint32_t DMACB2;
    stc_dmac_dmacb2_field_t DMACB2_f;
  };
  __IO uint32_t DMACSA2;
  __IO uint32_t DMACDA2;
  union {
    __IO uint32_t DMACA3;
    stc_dmac_dmaca3_field_t DMACA3_f;
  };
  union {
    __IO uint32_t DMACB3;
    stc_dmac_dmacb3_field_t DMACB3_f;
  };
  __IO uint32_t DMACSA3;
  __IO uint32_t DMACDA3;
  union {
    __IO uint32_t DMACA4;
    stc_dmac_dmaca4_field_t DMACA4_f;
  };
  union {
    __IO uint32_t DMACB4;
    stc_dmac_dmacb4_field_t DMACB4_f;
  };
  __IO uint32_t DMACSA4;
  __IO uint32_t DMACDA4;
  union {
    __IO uint32_t DMACA5;
    stc_dmac_dmaca5_field_t DMACA5_f;
  };
  union {
    __IO uint32_t DMACB5;
    stc_dmac_dmacb5_field_t DMACB5_f;
  };
  __IO uint32_t DMACSA5;
  __IO uint32_t DMACDA5;
  union {
    __IO uint32_t DMACA6;
    stc_dmac_dmaca6_field_t DMACA6_f;
  };
  union {
    __IO uint32_t DMACB6;
    stc_dmac_dmacb6_field_t DMACB6_f;
  };
  __IO uint32_t DMACSA6;
  __IO uint32_t DMACDA6;
  union {
    __IO uint32_t DMACA7;
    stc_dmac_dmaca7_field_t DMACA7_f;
  };
  union {
    __IO uint32_t DMACB7;
    stc_dmac_dmacb7_field_t DMACB7_f;
  };
  __IO uint32_t DMACSA7;
  __IO uint32_t DMACDA7;
}FM3_DMAC_TypeDef;

/******************************************************************************
 * ETHERNET_MAC_MODULE
 ******************************************************************************/
/* ETHERNET-MAC registers */
typedef struct
{
  union {
    __IO uint32_t MCR;
    stc_ethernet_mac_mcr_field_t MCR_f;
  };
  union {
    __IO uint32_t MFFR;
    stc_ethernet_mac_mffr_field_t MFFR_f;
  };
  union {
    __IO uint32_t MHTRH;
    stc_ethernet_mac_mhtrh_field_t MHTRH_f;
  };
  union {
    __IO uint32_t MHTRL;
    stc_ethernet_mac_mhtrl_field_t MHTRL_f;
  };
  union {
    __IO uint32_t GAR;
    stc_ethernet_mac_gar_field_t GAR_f;
  };
  union {
    __IO uint32_t GDR;
    stc_ethernet_mac_gdr_field_t GDR_f;
  };
  union {
    __IO uint32_t FCR;
    stc_ethernet_mac_fcr_field_t FCR_f;
  };
  union {
    __IO uint32_t VTR;
    stc_ethernet_mac_vtr_field_t VTR_f;
  };
        uint8_t RESERVED0[8];
  union {
    __IO uint32_t RWFFR;
    stc_ethernet_mac_rwffr_field_t RWFFR_f;
  };
  union {
    __IO uint32_t PMTR;
    stc_ethernet_mac_pmtr_field_t PMTR_f;
  };
  union {
    __IO uint32_t LPICSR;
    stc_ethernet_mac_lpicsr_field_t LPICSR_f;
  };
  union {
    __IO uint32_t LPITCR;
    stc_ethernet_mac_lpitcr_field_t LPITCR_f;
  };
  union {
    __IO uint32_t ISR;
    stc_ethernet_mac_isr_field_t ISR_f;
  };
  union {
    __IO uint32_t IMR;
    stc_ethernet_mac_imr_field_t IMR_f;
  };
  union {
    __IO uint32_t MAR0H;
    stc_ethernet_mac_mar0h_field_t MAR0H_f;
  };
  union {
    __IO uint32_t MAR0L;
    stc_ethernet_mac_mar0l_field_t MAR0L_f;
  };
  union {
    __IO uint32_t MAR1H;
    stc_ethernet_mac_mar1h_field_t MAR1H_f;
  };
  union {
    __IO uint32_t MAR1L;
    stc_ethernet_mac_mar1l_field_t MAR1L_f;
  };
  union {
    __IO uint32_t MAR2H;
    stc_ethernet_mac_mar2h_field_t MAR2H_f;
  };
  union {
    __IO uint32_t MAR2L;
    stc_ethernet_mac_mar2l_field_t MAR2L_f;
  };
  union {
    __IO uint32_t MAR3H;
    stc_ethernet_mac_mar3h_field_t MAR3H_f;
  };
  union {
    __IO uint32_t MAR3L;
    stc_ethernet_mac_mar3l_field_t MAR3L_f;
  };
  union {
    __IO uint32_t MAR4H;
    stc_ethernet_mac_mar4h_field_t MAR4H_f;
  };
  union {
    __IO uint32_t MAR4L;
    stc_ethernet_mac_mar4l_field_t MAR4L_f;
  };
  union {
    __IO uint32_t MAR5H;
    stc_ethernet_mac_mar5h_field_t MAR5H_f;
  };
  union {
    __IO uint32_t MAR5L;
    stc_ethernet_mac_mar5l_field_t MAR5L_f;
  };
  union {
    __IO uint32_t MAR6H;
    stc_ethernet_mac_mar6h_field_t MAR6H_f;
  };
  union {
    __IO uint32_t MAR6L;
    stc_ethernet_mac_mar6l_field_t MAR6L_f;
  };
  union {
    __IO uint32_t MAR7H;
    stc_ethernet_mac_mar7h_field_t MAR7H_f;
  };
  union {
    __IO uint32_t MAR7L;
    stc_ethernet_mac_mar7l_field_t MAR7L_f;
  };
  union {
    __IO uint32_t MAR8H;
    stc_ethernet_mac_mar8h_field_t MAR8H_f;
  };
  union {
    __IO uint32_t MAR8L;
    stc_ethernet_mac_mar8l_field_t MAR8L_f;
  };
  union {
    __IO uint32_t MAR9H;
    stc_ethernet_mac_mar9h_field_t MAR9H_f;
  };
  union {
    __IO uint32_t MAR9L;
    stc_ethernet_mac_mar9l_field_t MAR9L_f;
  };
  union {
    __IO uint32_t MAR10H;
    stc_ethernet_mac_mar10h_field_t MAR10H_f;
  };
  union {
    __IO uint32_t MAR10L;
    stc_ethernet_mac_mar10l_field_t MAR10L_f;
  };
  union {
    __IO uint32_t MAR11H;
    stc_ethernet_mac_mar11h_field_t MAR11H_f;
  };
  union {
    __IO uint32_t MAR11L;
    stc_ethernet_mac_mar11l_field_t MAR11L_f;
  };
  union {
    __IO uint32_t MAR12H;
    stc_ethernet_mac_mar12h_field_t MAR12H_f;
  };
  union {
    __IO uint32_t MAR12L;
    stc_ethernet_mac_mar12l_field_t MAR12L_f;
  };
  union {
    __IO uint32_t MAR13H;
    stc_ethernet_mac_mar13h_field_t MAR13H_f;
  };
  union {
    __IO uint32_t MAR13L;
    stc_ethernet_mac_mar13l_field_t MAR13L_f;
  };
  union {
    __IO uint32_t MAR14H;
    stc_ethernet_mac_mar14h_field_t MAR14H_f;
  };
  union {
    __IO uint32_t MAR14L;
    stc_ethernet_mac_mar14l_field_t MAR14L_f;
  };
  union {
    __IO uint32_t MAR15H;
    stc_ethernet_mac_mar15h_field_t MAR15H_f;
  };
  union {
    __IO uint32_t MAR15L;
    stc_ethernet_mac_mar15l_field_t MAR15L_f;
  };
        uint8_t RESERVED1[24];
  union {
    __IO uint32_t RGSR;
    stc_ethernet_mac_rgsr_field_t RGSR_f;
  };
        uint8_t RESERVED2[36];
  __IO uint32_t mmc_cntl;
  __IO uint32_t mmc_intr_rx;
  __IO uint32_t mmc_intr_tx;
  __IO uint32_t mmc_intr_mask_rx;
  __IO uint32_t mmc_intr_mask_tx;
  __IO uint32_t txoctetcount_gb;
  __IO uint32_t txframecount_gb;
  __IO uint32_t txbroadcastframes_g;
  __IO uint32_t txmulticastframes_g;
  __IO uint32_t tx64octets_gb;
  __IO uint32_t tx65to127octets_gb;
  __IO uint32_t tx128to255octets_gb;
  __IO uint32_t tx256to511octets_gb;
  __IO uint32_t tx512to1023octets_gb;
  __IO uint32_t tx1024tomaxoctets_gb;
  __IO uint32_t txunicastframes_gb;
  __IO uint32_t txmulticastframes_gb;
  __IO uint32_t txbroadcastframes_gb;
  __IO uint32_t txunderflowerror;
  __IO uint32_t txsinglecol_g;
  __IO uint32_t txmulticol_g;
  __IO uint32_t txdeferred;
  __IO uint32_t txlatecol;
  __IO uint32_t txexesscol;
  __IO uint32_t txcarriererror;
  __IO uint32_t txoctetcount_g;
  __IO uint32_t txframecount_g;
  __IO uint32_t txexecessdef_g;
  __IO uint32_t txpauseframes;
  __IO uint32_t txvlanframes_g;
        uint8_t RESERVED3[8];
  __IO uint32_t rxframecount_gb;
  __IO uint32_t rxoctetcount_gb;
  __IO uint32_t rxoctetcount_g;
  __IO uint32_t rxbroadcastframes_g;
  __IO uint32_t rxmulticastframes_g;
  __IO uint32_t rxcrcerror;
  __IO uint32_t rxallignmenterror;
  __IO uint32_t rxrunterror;
  __IO uint32_t rxjabbererror;
  __IO uint32_t rxundersize_g;
  __IO uint32_t rxoversize_g;
  __IO uint32_t rx64octets_gb;
  __IO uint32_t rx65to127octets_gb;
  __IO uint32_t rx128to255octets_gb;
  __IO uint32_t rx256to511octets_gb;
  __IO uint32_t rx512to1023octets_gb;
  __IO uint32_t rx1024tomaxoctets_gb;
  __IO uint32_t rxunicastframes_g;
  __IO uint32_t rxlengtherror;
  __IO uint32_t rxoutofrangetype;
  __IO uint32_t rxpauseframes;
  __IO uint32_t rxfifooverflow;
  __IO uint32_t rxvlanframes_gb;
  __IO uint32_t rxwatchdogerror;
        uint8_t RESERVED4[32];
  __IO uint32_t mmc_ipc_intr_mask_rx;
        uint8_t RESERVED5[4];
  __IO uint32_t mmc_ipc_intr_rx;
        uint8_t RESERVED6[4];
  __IO uint32_t rxipv4_gd_frms;
  __IO uint32_t rxipv4_hdrerr_frms;
  __IO uint32_t rxipv4_nopay_frms;
  __IO uint32_t rxipv4_frag_frms;
  __IO uint32_t rxipv4_udsbl_frms;
  __IO uint32_t rxipv6_gd_frms;
  __IO uint32_t rxipv6_hdrerr_frms;
  __IO uint32_t rxipv6_nopay_frms;
  __IO uint32_t rxudp_gd_frms;
  __IO uint32_t rxudp_err_frms;
  __IO uint32_t rxtcp_gd_frms;
  __IO uint32_t rxtcp_err_frms;
  __IO uint32_t rxicmp_gd_frms;
  __IO uint32_t rxicmp_err_frms;
        uint8_t RESERVED7[8];
  __IO uint32_t rxipv4_gd_octets;
  __IO uint32_t rxipv4_hdrerr_octets;
  __IO uint32_t rxipv4_nopay_octets;
  __IO uint32_t rxipv4_frag_octets;
  __IO uint32_t rxipv4_udsbl_octets;
  __IO uint32_t rxipv6_gd_octets;
  __IO uint32_t rxipv6_hdrerr_octets;
  __IO uint32_t rxipv6_nopay_octets;
  __IO uint32_t rxudp_gd_octets;
  __IO uint32_t rxudp_err_octets;
  __IO uint32_t rxtcp_gd_octets;
  __IO uint32_t rxtcp_err_octets;
  __IO uint32_t rxicmp_gd_octets;
  __IO uint32_t rxicmp_err_octets;
        uint8_t RESERVED8[1144];
  union {
    __IO uint32_t TSCR;
    stc_ethernet_mac_tscr_field_t TSCR_f;
  };
  union {
    __IO uint32_t SSIR;
    stc_ethernet_mac_ssir_field_t SSIR_f;
  };
  union {
    __IO uint32_t STSR;
    stc_ethernet_mac_stsr_field_t STSR_f;
  };
  union {
    __IO uint32_t STNR;
    stc_ethernet_mac_stnr_field_t STNR_f;
  };
  union {
    __IO uint32_t STSUR;
    stc_ethernet_mac_stsur_field_t STSUR_f;
  };
  union {
    __IO uint32_t STNUR;
    stc_ethernet_mac_stnur_field_t STNUR_f;
  };
  union {
    __IO uint32_t TSAR;
    stc_ethernet_mac_tsar_field_t TSAR_f;
  };
  union {
    __IO uint32_t TTSR;
    stc_ethernet_mac_ttsr_field_t TTSR_f;
  };
  union {
    __IO uint32_t TTNR;
    stc_ethernet_mac_ttnr_field_t TTNR_f;
  };
  union {
    __IO uint32_t STHWSR;
    stc_ethernet_mac_sthwsr_field_t STHWSR_f;
  };
  union {
    __IO uint32_t TSR;
    stc_ethernet_mac_tsr_field_t TSR_f;
  };
  union {
    __IO uint32_t PPSCR;
    stc_ethernet_mac_ppscr_field_t PPSCR_f;
  };
  union {
    __IO uint32_t ATNR;
    stc_ethernet_mac_atnr_field_t ATNR_f;
  };
  union {
    __IO uint32_t ATSR;
    stc_ethernet_mac_atsr_field_t ATSR_f;
  };
        uint8_t RESERVED9[200];
  union {
    __IO uint32_t MAR16H;
    stc_ethernet_mac_mar16h_field_t MAR16H_f;
  };
  union {
    __IO uint32_t MAR16L;
    stc_ethernet_mac_mar16l_field_t MAR16L_f;
  };
  union {
    __IO uint32_t MAR17H;
    stc_ethernet_mac_mar17h_field_t MAR17H_f;
  };
  union {
    __IO uint32_t MAR17L;
    stc_ethernet_mac_mar17l_field_t MAR17L_f;
  };
  union {
    __IO uint32_t MAR18H;
    stc_ethernet_mac_mar18h_field_t MAR18H_f;
  };
  union {
    __IO uint32_t MAR18L;
    stc_ethernet_mac_mar18l_field_t MAR18L_f;
  };
  union {
    __IO uint32_t MAR19H;
    stc_ethernet_mac_mar19h_field_t MAR19H_f;
  };
  union {
    __IO uint32_t MAR19L;
    stc_ethernet_mac_mar19l_field_t MAR19L_f;
  };
  union {
    __IO uint32_t MAR20H;
    stc_ethernet_mac_mar20h_field_t MAR20H_f;
  };
  union {
    __IO uint32_t MAR20L;
    stc_ethernet_mac_mar20l_field_t MAR20L_f;
  };
  union {
    __IO uint32_t MAR21H;
    stc_ethernet_mac_mar21h_field_t MAR21H_f;
  };
  union {
    __IO uint32_t MAR21L;
    stc_ethernet_mac_mar21l_field_t MAR21L_f;
  };
  union {
    __IO uint32_t MAR22H;
    stc_ethernet_mac_mar22h_field_t MAR22H_f;
  };
  union {
    __IO uint32_t MAR22L;
    stc_ethernet_mac_mar22l_field_t MAR22L_f;
  };
  union {
    __IO uint32_t MAR23H;
    stc_ethernet_mac_mar23h_field_t MAR23H_f;
  };
  union {
    __IO uint32_t MAR23L;
    stc_ethernet_mac_mar23l_field_t MAR23L_f;
  };
  union {
    __IO uint32_t MAR24H;
    stc_ethernet_mac_mar24h_field_t MAR24H_f;
  };
  union {
    __IO uint32_t MAR24L;
    stc_ethernet_mac_mar24l_field_t MAR24L_f;
  };
  union {
    __IO uint32_t MAR25H;
    stc_ethernet_mac_mar25h_field_t MAR25H_f;
  };
  union {
    __IO uint32_t MAR25L;
    stc_ethernet_mac_mar25l_field_t MAR25L_f;
  };
  union {
    __IO uint32_t MAR26H;
    stc_ethernet_mac_mar26h_field_t MAR26H_f;
  };
  union {
    __IO uint32_t MAR26L;
    stc_ethernet_mac_mar26l_field_t MAR26L_f;
  };
  union {
    __IO uint32_t MAR27H;
    stc_ethernet_mac_mar27h_field_t MAR27H_f;
  };
  union {
    __IO uint32_t MAR27L;
    stc_ethernet_mac_mar27l_field_t MAR27L_f;
  };
  union {
    __IO uint32_t MAR28H;
    stc_ethernet_mac_mar28h_field_t MAR28H_f;
  };
  union {
    __IO uint32_t MAR28L;
    stc_ethernet_mac_mar28l_field_t MAR28L_f;
  };
  union {
    __IO uint32_t MAR29H;
    stc_ethernet_mac_mar29h_field_t MAR29H_f;
  };
  union {
    __IO uint32_t MAR29L;
    stc_ethernet_mac_mar29l_field_t MAR29L_f;
  };
  union {
    __IO uint32_t MAR30H;
    stc_ethernet_mac_mar30h_field_t MAR30H_f;
  };
  union {
    __IO uint32_t MAR30L;
    stc_ethernet_mac_mar30l_field_t MAR30L_f;
  };
  union {
    __IO uint32_t MAR31H;
    stc_ethernet_mac_mar31h_field_t MAR31H_f;
  };
  union {
    __IO uint32_t MAR31L;
    stc_ethernet_mac_mar31l_field_t MAR31L_f;
  };
        uint8_t RESERVED10[1920];
  union {
    __IO uint32_t BMR;
    stc_ethernet_mac_bmr_field_t BMR_f;
  };
  union {
    __IO uint32_t TPDR;
    stc_ethernet_mac_tpdr_field_t TPDR_f;
  };
  union {
    __IO uint32_t RPDR;
    stc_ethernet_mac_rpdr_field_t RPDR_f;
  };
  union {
    __IO uint32_t RDLAR;
    stc_ethernet_mac_rdlar_field_t RDLAR_f;
  };
  union {
    __IO uint32_t TDLAR;
    stc_ethernet_mac_tdlar_field_t TDLAR_f;
  };
  union {
    __IO uint32_t SR;
    stc_ethernet_mac_sr_field_t SR_f;
  };
  union {
    __IO uint32_t OMR;
    stc_ethernet_mac_omr_field_t OMR_f;
  };
  union {
    __IO uint32_t IER;
    stc_ethernet_mac_ier_field_t IER_f;
  };
  union {
    __IO uint32_t MFBOCR;
    stc_ethernet_mac_mfbocr_field_t MFBOCR_f;
  };
  union {
    __IO uint32_t RIWTR;
    stc_ethernet_mac_riwtr_field_t RIWTR_f;
  };
        uint8_t RESERVED11[4];
  union {
    __IO uint32_t AHBSR;
    stc_ethernet_mac_ahbsr_field_t AHBSR_f;
  };
        uint8_t RESERVED12[24];
  union {
    __IO uint32_t CHTDR;
    stc_ethernet_mac_chtdr_field_t CHTDR_f;
  };
  union {
    __IO uint32_t CHRDR;
    stc_ethernet_mac_chrdr_field_t CHRDR_f;
  };
  union {
    __IO uint32_t CHTBAR;
    stc_ethernet_mac_chtbar_field_t CHTBAR_f;
  };
  union {
    __IO uint32_t CHRBAR;
    stc_ethernet_mac_chrbar_field_t CHRBAR_f;
  };
}FM3_ETHERNET_MAC_TypeDef;

/* ETHERNET-CONTROL registers */
typedef struct
{
  union {
    __IO uint32_t ETH_MODE;
    stc_ethernet_control_eth_mode_field_t ETH_MODE_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t ETH_CLKG;
    stc_ethernet_control_eth_clkg_field_t ETH_CLKG_f;
  };
}FM3_ETHERNET_CONTROL_TypeDef;

