AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
/* Multifunction Timer unit 1 Input Capture Unit registers */
#define bFM3_MFT1_ICU_ICFS10_FSI00             *((volatile unsigned int*)(0x42420C00UL))
#define bFM3_MFT1_ICU_ICFS10_FSI01             *((volatile unsigned int*)(0x42420C04UL))
#define bFM3_MFT1_ICU_ICFS10_FSI02             *((volatile unsigned int*)(0x42420C08UL))
#define bFM3_MFT1_ICU_ICFS10_FSI03             *((volatile unsigned int*)(0x42420C0CUL))
#define bFM3_MFT1_ICU_ICFS10_FSI10             *((volatile unsigned int*)(0x42420C10UL))
#define bFM3_MFT1_ICU_ICFS10_FSI11             *((volatile unsigned int*)(0x42420C14UL))
#define bFM3_MFT1_ICU_ICFS10_FSI12             *((volatile unsigned int*)(0x42420C18UL))
#define bFM3_MFT1_ICU_ICFS10_FSI13             *((volatile unsigned int*)(0x42420C1CUL))
#define bFM3_MFT1_ICU_ICFS32_FSI20             *((volatile unsigned int*)(0x42420C20UL))
#define bFM3_MFT1_ICU_ICFS32_FSI21             *((volatile unsigned int*)(0x42420C24UL))
#define bFM3_MFT1_ICU_ICFS32_FSI22             *((volatile unsigned int*)(0x42420C28UL))
#define bFM3_MFT1_ICU_ICFS32_FSI23             *((volatile unsigned int*)(0x42420C2CUL))
#define bFM3_MFT1_ICU_ICFS32_FSI30             *((volatile unsigned int*)(0x42420C30UL))
#define bFM3_MFT1_ICU_ICFS32_FSI31             *((volatile unsigned int*)(0x42420C34UL))
#define bFM3_MFT1_ICU_ICFS32_FSI32             *((volatile unsigned int*)(0x42420C38UL))
#define bFM3_MFT1_ICU_ICFS32_FSI33             *((volatile unsigned int*)(0x42420C3CUL))
#define bFM3_MFT1_ICU_ICSA10_EG00              *((volatile unsigned int*)(0x42420F00UL))
#define bFM3_MFT1_ICU_ICSA10_EG01              *((volatile unsigned int*)(0x42420F04UL))
#define bFM3_MFT1_ICU_ICSA10_EG10              *((volatile unsigned int*)(0x42420F08UL))
#define bFM3_MFT1_ICU_ICSA10_EG11              *((volatile unsigned int*)(0x42420F0CUL))
#define bFM3_MFT1_ICU_ICSA10_ICE0              *((volatile unsigned int*)(0x42420F10UL))
#define bFM3_MFT1_ICU_ICSA10_ICE1              *((volatile unsigned int*)(0x42420F14UL))
#define bFM3_MFT1_ICU_ICSA10_ICP0              *((volatile unsigned int*)(0x42420F18UL))
#define bFM3_MFT1_ICU_ICSA10_ICP1              *((volatile unsigned int*)(0x42420F1CUL))
#define bFM3_MFT1_ICU_ICSB10_IEI0              *((volatile unsigned int*)(0x42420F20UL))
#define bFM3_MFT1_ICU_ICSB10_IEI1              *((volatile unsigned int*)(0x42420F24UL))
#define bFM3_MFT1_ICU_ICSA32_EG20              *((volatile unsigned int*)(0x42420F80UL))
#define bFM3_MFT1_ICU_ICSA32_EG21              *((volatile unsigned int*)(0x42420F84UL))
#define bFM3_MFT1_ICU_ICSA32_EG30              *((volatile unsigned int*)(0x42420F88UL))
#define bFM3_MFT1_ICU_ICSA32_EG31              *((volatile unsigned int*)(0x42420F8CUL))
#define bFM3_MFT1_ICU_ICSA32_ICE2              *((volatile unsigned int*)(0x42420F90UL))
#define bFM3_MFT1_ICU_ICSA32_ICE3              *((volatile unsigned int*)(0x42420F94UL))
#define bFM3_MFT1_ICU_ICSA32_ICP2              *((volatile unsigned int*)(0x42420F98UL))
#define bFM3_MFT1_ICU_ICSA32_ICP3              *((volatile unsigned int*)(0x42420F9CUL))
#define bFM3_MFT1_ICU_ICSB32_IEI2              *((volatile unsigned int*)(0x42420FA0UL))
#define bFM3_MFT1_ICU_ICSB32_IEI3              *((volatile unsigned int*)(0x42420FA4UL))

/* Multifunction Timer unit 1 ADC Start Compare Unit registers */
#define bFM3_MFT1_ADCMP_ACSB_BDIS0             *((volatile unsigned int*)(0x42421700UL))
#define bFM3_MFT1_ADCMP_ACSB_BDIS1             *((volatile unsigned int*)(0x42421704UL))
#define bFM3_MFT1_ADCMP_ACSB_BDIS2             *((volatile unsigned int*)(0x42421708UL))
#define bFM3_MFT1_ADCMP_ACSB_BTS0              *((volatile unsigned int*)(0x42421710UL))
#define bFM3_MFT1_ADCMP_ACSB_BTS1              *((volatile unsigned int*)(0x42421714UL))
#define bFM3_MFT1_ADCMP_ACSB_BTS2              *((volatile unsigned int*)(0x42421718UL))
#define bFM3_MFT1_ADCMP_ACSA_CE00              *((volatile unsigned int*)(0x42421780UL))
#define bFM3_MFT1_ADCMP_ACSA_CE01              *((volatile unsigned int*)(0x42421784UL))
#define bFM3_MFT1_ADCMP_ACSA_CE10              *((volatile unsigned int*)(0x42421788UL))
#define bFM3_MFT1_ADCMP_ACSA_CE11              *((volatile unsigned int*)(0x4242178CUL))
#define bFM3_MFT1_ADCMP_ACSA_CE20              *((volatile unsigned int*)(0x42421790UL))
#define bFM3_MFT1_ADCMP_ACSA_CE21              *((volatile unsigned int*)(0x42421794UL))
#define bFM3_MFT1_ADCMP_ACSA_SEL00             *((volatile unsigned int*)(0x424217A0UL))
#define bFM3_MFT1_ADCMP_ACSA_SEL01             *((volatile unsigned int*)(0x424217A4UL))
#define bFM3_MFT1_ADCMP_ACSA_SEL10             *((volatile unsigned int*)(0x424217A8UL))
#define bFM3_MFT1_ADCMP_ACSA_SEL11             *((volatile unsigned int*)(0x424217ACUL))
#define bFM3_MFT1_ADCMP_ACSA_SEL20             *((volatile unsigned int*)(0x424217B0UL))
#define bFM3_MFT1_ADCMP_ACSA_SEL21             *((volatile unsigned int*)(0x424217B4UL))
#define bFM3_MFT1_ADCMP_ATSA_AD0S0             *((volatile unsigned int*)(0x42421800UL))
#define bFM3_MFT1_ADCMP_ATSA_AD0S1             *((volatile unsigned int*)(0x42421804UL))
#define bFM3_MFT1_ADCMP_ATSA_AD1S0             *((volatile unsigned int*)(0x42421808UL))
#define bFM3_MFT1_ADCMP_ATSA_AD1S1             *((volatile unsigned int*)(0x4242180CUL))
#define bFM3_MFT1_ADCMP_ATSA_AD2S0             *((volatile unsigned int*)(0x42421810UL))
#define bFM3_MFT1_ADCMP_ATSA_AD2S1             *((volatile unsigned int*)(0x42421814UL))
#define bFM3_MFT1_ADCMP_ATSA_AD0P0             *((volatile unsigned int*)(0x42421820UL))
#define bFM3_MFT1_ADCMP_ATSA_AD0P1             *((volatile unsigned int*)(0x42421824UL))
#define bFM3_MFT1_ADCMP_ATSA_AD1P0             *((volatile unsigned int*)(0x42421828UL))
#define bFM3_MFT1_ADCMP_ATSA_AD1P1             *((volatile unsigned int*)(0x4242182CUL))
#define bFM3_MFT1_ADCMP_ATSA_AD2P0             *((volatile unsigned int*)(0x42421830UL))
#define bFM3_MFT1_ADCMP_ATSA_AD2P1             *((volatile unsigned int*)(0x42421834UL))

/* Multifunction Timer unit 2 Free Running Timer registers */
#define bFM3_MFT2_FRT_TCSA0_CLK0               *((volatile unsigned int*)(0x42440600UL))
#define bFM3_MFT2_FRT_TCSA0_CLK1               *((volatile unsigned int*)(0x42440604UL))
#define bFM3_MFT2_FRT_TCSA0_CLK2               *((volatile unsigned int*)(0x42440608UL))
#define bFM3_MFT2_FRT_TCSA0_CLK3               *((volatile unsigned int*)(0x4244060CUL))
#define bFM3_MFT2_FRT_TCSA0_SCLR               *((volatile unsigned int*)(0x42440610UL))
#define bFM3_MFT2_FRT_TCSA0_MODE               *((volatile unsigned int*)(0x42440614UL))
#define bFM3_MFT2_FRT_TCSA0_STOP               *((volatile unsigned int*)(0x42440618UL))
#define bFM3_MFT2_FRT_TCSA0_BFE                *((volatile unsigned int*)(0x4244061CUL))
#define bFM3_MFT2_FRT_TCSA0_ICRE               *((volatile unsigned int*)(0x42440620UL))
#define bFM3_MFT2_FRT_TCSA0_ICLR               *((volatile unsigned int*)(0x42440624UL))
#define bFM3_MFT2_FRT_TCSA0_IRQZE              *((volatile unsigned int*)(0x42440634UL))
#define bFM3_MFT2_FRT_TCSA0_IRQZF              *((volatile unsigned int*)(0x42440638UL))
#define bFM3_MFT2_FRT_TCSA0_ECKE               *((volatile unsigned int*)(0x4244063CUL))
#define bFM3_MFT2_FRT_TCSB0_AD0E               *((volatile unsigned int*)(0x42440680UL))
#define bFM3_MFT2_FRT_TCSB0_AD1E               *((volatile unsigned int*)(0x42440684UL))
#define bFM3_MFT2_FRT_TCSB0_AD2E               *((volatile unsigned int*)(0x42440688UL))
#define bFM3_MFT2_FRT_TCSA1_CLK0               *((volatile unsigned int*)(0x42440800UL))
#define bFM3_MFT2_FRT_TCSA1_CLK1               *((volatile unsigned int*)(0x42440804UL))
#define bFM3_MFT2_FRT_TCSA1_CLK2               *((volatile unsigned int*)(0x42440808UL))
#define bFM3_MFT2_FRT_TCSA1_CLK3               *((volatile unsigned int*)(0x4244080CUL))
#define bFM3_MFT2_FRT_TCSA1_SCLR               *((volatile unsigned int*)(0x42440810UL))
#define bFM3_MFT2_FRT_TCSA1_MODE               *((volatile unsigned int*)(0x42440814UL))
#define bFM3_MFT2_FRT_TCSA1_STOP               *((volatile unsigned int*)(0x42440818UL))
#define bFM3_MFT2_FRT_TCSA1_BFE                *((volatile unsigned int*)(0x4244081CUL))
#define bFM3_MFT2_FRT_TCSA1_ICRE               *((volatile unsigned int*)(0x42440820UL))
#define bFM3_MFT2_FRT_TCSA1_ICLR               *((volatile unsigned int*)(0x42440824UL))
#define bFM3_MFT2_FRT_TCSA1_IRQZE              *((volatile unsigned int*)(0x42440834UL))
#define bFM3_MFT2_FRT_TCSA1_IRQZF              *((volatile unsigned int*)(0x42440838UL))
#define bFM3_MFT2_FRT_TCSA1_ECKE               *((volatile unsigned int*)(0x4244083CUL))
#define bFM3_MFT2_FRT_TCSB1_AD0E               *((volatile unsigned int*)(0x42440880UL))
#define bFM3_MFT2_FRT_TCSB1_AD1E               *((volatile unsigned int*)(0x42440884UL))
#define bFM3_MFT2_FRT_TCSB1_AD2E               *((volatile unsigned int*)(0x42440888UL))
#define bFM3_MFT2_FRT_TCSA2_CLK0               *((volatile unsigned int*)(0x42440A00UL))
#define bFM3_MFT2_FRT_TCSA2_CLK1               *((volatile unsigned int*)(0x42440A04UL))
#define bFM3_MFT2_FRT_TCSA2_CLK2               *((volatile unsigned int*)(0x42440A08UL))
#define bFM3_MFT2_FRT_TCSA2_CLK3               *((volatile unsigned int*)(0x42440A0CUL))
#define bFM3_MFT2_FRT_TCSA2_SCLR               *((volatile unsigned int*)(0x42440A10UL))
#define bFM3_MFT2_FRT_TCSA2_MODE               *((volatile unsigned int*)(0x42440A14UL))
#define bFM3_MFT2_FRT_TCSA2_STOP               *((volatile unsigned int*)(0x42440A18UL))
#define bFM3_MFT2_FRT_TCSA2_BFE                *((volatile unsigned int*)(0x42440A1CUL))
#define bFM3_MFT2_FRT_TCSA2_ICRE               *((volatile unsigned int*)(0x42440A20UL))
#define bFM3_MFT2_FRT_TCSA2_ICLR               *((volatile unsigned int*)(0x42440A24UL))
#define bFM3_MFT2_FRT_TCSA2_IRQZE              *((volatile unsigned int*)(0x42440A34UL))
#define bFM3_MFT2_FRT_TCSA2_IRQZF              *((volatile unsigned int*)(0x42440A38UL))
#define bFM3_MFT2_FRT_TCSA2_ECKE               *((volatile unsigned int*)(0x42440A3CUL))
#define bFM3_MFT2_FRT_TCSB2_AD0E               *((volatile unsigned int*)(0x42440A80UL))
#define bFM3_MFT2_FRT_TCSB2_AD1E               *((volatile unsigned int*)(0x42440A84UL))
#define bFM3_MFT2_FRT_TCSB2_AD2E               *((volatile unsigned int*)(0x42440A88UL))

/* Multifunction Timer unit 2 Output Compare Unit registers */
#define bFM3_MFT2_OCU_OCSA10_CST0              *((volatile unsigned int*)(0x42440300UL))
#define bFM3_MFT2_OCU_OCSA10_CST1              *((volatile unsigned int*)(0x42440304UL))
#define bFM3_MFT2_OCU_OCSA10_BDIS0             *((volatile unsigned int*)(0x42440308UL))
#define bFM3_MFT2_OCU_OCSA10_BDIS1             *((volatile unsigned int*)(0x4244030CUL))
#define bFM3_MFT2_OCU_OCSA10_IOE0              *((volatile unsigned int*)(0x42440310UL))
#define bFM3_MFT2_OCU_OCSA10_IOE1              *((volatile unsigned int*)(0x42440314UL))
#define bFM3_MFT2_OCU_OCSA10_IOP0              *((volatile unsigned int*)(0x42440318UL))
#define bFM3_MFT2_OCU_OCSA10_IOP1              *((volatile unsigned int*)(0x4244031CUL))
#define bFM3_MFT2_OCU_OCSB10_OTD0              *((volatile unsigned int*)(0x42440320UL))
#define bFM3_MFT2_OCU_OCSB10_OTD1              *((volatile unsigned int*)(0x42440324UL))
#define bFM3_MFT2_OCU_OCSB10_CMOD              *((volatile unsigned int*)(0x42440330UL))
#define bFM3_MFT2_OCU_OCSB10_BTS0              *((volatile unsigned int*)(0x42440334UL))
#define bFM3_MFT2_OCU_OCSB10_BTS1              *((volatile unsigned int*)(0x42440338UL))
#define bFM3_MFT2_OCU_OCSA32_CST2              *((volatile unsigned int*)(0x42440380UL))
#define bFM3_MFT2_OCU_OCSA32_CST3              *((volatile unsigned int*)(0x42440384UL))
#define bFM3_MFT2_OCU_OCSA32_BDIS2             *((volatile unsigned int*)(0x42440388UL))
#define bFM3_MFT2_OCU_OCSA32_BDIS3             *((volatile unsigned int*)(0x4244038CUL))
#define bFM3_MFT2_OCU_OCSA32_IOE2              *((volatile unsigned int*)(0x42440390UL))
#define bFM3_MFT2_OCU_OCSA32_IOE3              *((volatile unsigned int*)(0x42440394UL))
#define bFM3_MFT2_OCU_OCSA32_IOP2              *((volatile unsigned int*)(0x42440398UL))
#define bFM3_MFT2_OCU_OCSA32_IOP3              *((volatile unsigned int*)(0x4244039CUL))
#define bFM3_MFT2_OCU_OCSB32_OTD2              *((volatile unsigned int*)(0x424403A0UL))
#define bFM3_MFT2_OCU_OCSB32_OTD3              *((volatile unsigned int*)(0x424403A4UL))
#define bFM3_MFT2_OCU_OCSB32_CMOD              *((volatile unsigned int*)(0x424403B0UL))
#define bFM3_MFT2_OCU_OCSB32_BTS2              *((volatile unsigned int*)(0x424403B4UL))
#define bFM3_MFT2_OCU_OCSB32_BTS3              *((volatile unsigned int*)(0x424403B8UL))
#define bFM3_MFT2_OCU_OCSA54_CST4              *((volatile unsigned int*)(0x42440400UL))
#define bFM3_MFT2_OCU_OCSA54_CST5              *((volatile unsigned int*)(0x42440404UL))
#define bFM3_MFT2_OCU_OCSA54_BDIS4             *((volatile unsigned int*)(0x42440408UL))
#define bFM3_MFT2_OCU_OCSA54_BDIS5             *((volatile unsigned int*)(0x4244040CUL))
#define bFM3_MFT2_OCU_OCSA54_IOE4              *((volatile unsigned int*)(0x42440410UL))
#define bFM3_MFT2_OCU_OCSA54_IOE5              *((volatile unsigned int*)(0x42440414UL))
#define bFM3_MFT2_OCU_OCSA54_IOP4              *((volatile unsigned int*)(0x42440418UL))
#define bFM3_MFT2_OCU_OCSA54_IOP5              *((volatile unsigned int*)(0x4244041CUL))
#define bFM3_MFT2_OCU_OCSB54_OTD4              *((volatile unsigned int*)(0x42440420UL))
#define bFM3_MFT2_OCU_OCSB54_OTD5              *((volatile unsigned int*)(0x42440424UL))
#define bFM3_MFT2_OCU_OCSB54_CMOD              *((volatile unsigned int*)(0x42440430UL))
#define bFM3_MFT2_OCU_OCSB54_BTS4              *((volatile unsigned int*)(0x42440434UL))
#define bFM3_MFT2_OCU_OCSB54_BTS5              *((volatile unsigned int*)(0x42440438UL))
#define bFM3_MFT2_OCU_OCSC_MOD0                *((volatile unsigned int*)(0x424404A0UL))
#define bFM3_MFT2_OCU_OCSC_MOD1                *((volatile unsigned int*)(0x424404A4UL))
#define bFM3_MFT2_OCU_OCSC_MOD2                *((volatile unsigned int*)(0x424404A8UL))
#define bFM3_MFT2_OCU_OCSC_MOD3                *((volatile unsigned int*)(0x424404ACUL))
#define bFM3_MFT2_OCU_OCSC_MOD4                *((volatile unsigned int*)(0x424404B0UL))
#define bFM3_MFT2_OCU_OCSC_MOD5                *((volatile unsigned int*)(0x424404B4UL))
#define bFM3_MFT2_OCU_OCFS10_FSO00             *((volatile unsigned int*)(0x42440B00UL))
#define bFM3_MFT2_OCU_OCFS10_FSO01             *((volatile unsigned int*)(0x42440B04UL))
#define bFM3_MFT2_OCU_OCFS10_FSO02             *((volatile unsigned int*)(0x42440B08UL))
#define bFM3_MFT2_OCU_OCFS10_FSO03             *((volatile unsigned int*)(0x42440B0CUL))
#define bFM3_MFT2_OCU_OCFS10_FSO10             *((volatile unsigned int*)(0x42440B10UL))
#define bFM3_MFT2_OCU_OCFS10_FSO11             *((volatile unsigned int*)(0x42440B14UL))
#define bFM3_MFT2_OCU_OCFS10_FSO12             *((volatile unsigned int*)(0x42440B18UL))
#define bFM3_MFT2_OCU_OCFS10_FSO13             *((volatile unsigned int*)(0x42440B1CUL))
#define bFM3_MFT2_OCU_OCFS32_FSO20             *((volatile unsigned int*)(0x42440B20UL))
#define bFM3_MFT2_OCU_OCFS32_FSO21             *((volatile unsigned int*)(0x42440B24UL))
#define bFM3_MFT2_OCU_OCFS32_FSO22             *((volatile unsigned int*)(0x42440B28UL))
#define bFM3_MFT2_OCU_OCFS32_FSO23             *((volatile unsigned int*)(0x42440B2CUL))
#define bFM3_MFT2_OCU_OCFS32_FSO30             *((volatile unsigned int*)(0x42440B30UL))
#define bFM3_MFT2_OCU_OCFS32_FSO31             *((volatile unsigned int*)(0x42440B34UL))
#define bFM3_MFT2_OCU_OCFS32_FSO32             *((volatile unsigned int*)(0x42440B38UL))
#define bFM3_MFT2_OCU_OCFS32_FSO33             *((volatile unsigned int*)(0x42440B3CUL))
#define bFM3_MFT2_OCU_OCFS54_FSO40             *((volatile unsigned int*)(0x42440B80UL))
#define bFM3_MFT2_OCU_OCFS54_FSO41             *((volatile unsigned int*)(0x42440B84UL))
#define bFM3_MFT2_OCU_OCFS54_FSO42             *((volatile unsigned int*)(0x42440B88UL))
#define bFM3_MFT2_OCU_OCFS54_FSO43             *((volatile unsigned int*)(0x42440B8CUL))
#define bFM3_MFT2_OCU_OCFS54_FSO50             *((volatile unsigned int*)(0x42440B90UL))
#define bFM3_MFT2_OCU_OCFS54_FSO51             *((volatile unsigned int*)(0x42440B94UL))
#define bFM3_MFT2_OCU_OCFS54_FSO52             *((volatile unsigned int*)(0x42440B98UL))
#define bFM3_MFT2_OCU_OCFS54_FSO53             *((volatile unsigned int*)(0x42440B9CUL))

