AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
/* External interrupt registers */
#define bFM3_EXTI_ENIR_EN0                     *((volatile unsigned int*)(0x42600000UL))
#define bFM3_EXTI_ENIR_EN1                     *((volatile unsigned int*)(0x42600004UL))
#define bFM3_EXTI_ENIR_EN2                     *((volatile unsigned int*)(0x42600008UL))
#define bFM3_EXTI_ENIR_EN3                     *((volatile unsigned int*)(0x4260000CUL))
#define bFM3_EXTI_ENIR_EN4                     *((volatile unsigned int*)(0x42600010UL))
#define bFM3_EXTI_ENIR_EN5                     *((volatile unsigned int*)(0x42600014UL))
#define bFM3_EXTI_ENIR_EN6                     *((volatile unsigned int*)(0x42600018UL))
#define bFM3_EXTI_ENIR_EN7                     *((volatile unsigned int*)(0x4260001CUL))
#define bFM3_EXTI_ENIR_EN8                     *((volatile unsigned int*)(0x42600020UL))
#define bFM3_EXTI_ENIR_EN9                     *((volatile unsigned int*)(0x42600024UL))
#define bFM3_EXTI_ENIR_EN10                    *((volatile unsigned int*)(0x42600028UL))
#define bFM3_EXTI_ENIR_EN11                    *((volatile unsigned int*)(0x4260002CUL))
#define bFM3_EXTI_ENIR_EN12                    *((volatile unsigned int*)(0x42600030UL))
#define bFM3_EXTI_ENIR_EN13                    *((volatile unsigned int*)(0x42600034UL))
#define bFM3_EXTI_ENIR_EN14                    *((volatile unsigned int*)(0x42600038UL))
#define bFM3_EXTI_ENIR_EN15                    *((volatile unsigned int*)(0x4260003CUL))
#define bFM3_EXTI_ENIR_EN16                    *((volatile unsigned int*)(0x42600040UL))
#define bFM3_EXTI_ENIR_EN17                    *((volatile unsigned int*)(0x42600044UL))
#define bFM3_EXTI_ENIR_EN18                    *((volatile unsigned int*)(0x42600048UL))
#define bFM3_EXTI_ENIR_EN19                    *((volatile unsigned int*)(0x4260004CUL))
#define bFM3_EXTI_ENIR_EN20                    *((volatile unsigned int*)(0x42600050UL))
#define bFM3_EXTI_ENIR_EN21                    *((volatile unsigned int*)(0x42600054UL))
#define bFM3_EXTI_ENIR_EN22                    *((volatile unsigned int*)(0x42600058UL))
#define bFM3_EXTI_ENIR_EN23                    *((volatile unsigned int*)(0x4260005CUL))
#define bFM3_EXTI_ENIR_EN24                    *((volatile unsigned int*)(0x42600060UL))
#define bFM3_EXTI_ENIR_EN25                    *((volatile unsigned int*)(0x42600064UL))
#define bFM3_EXTI_ENIR_EN26                    *((volatile unsigned int*)(0x42600068UL))
#define bFM3_EXTI_ENIR_EN27                    *((volatile unsigned int*)(0x4260006CUL))
#define bFM3_EXTI_ENIR_EN28                    *((volatile unsigned int*)(0x42600070UL))
#define bFM3_EXTI_ENIR_EN29                    *((volatile unsigned int*)(0x42600074UL))
#define bFM3_EXTI_ENIR_EN30                    *((volatile unsigned int*)(0x42600078UL))
#define bFM3_EXTI_ENIR_EN31                    *((volatile unsigned int*)(0x4260007CUL))
#define bFM3_EXTI_EIRR_ER0                     *((volatile unsigned int*)(0x42600080UL))
#define bFM3_EXTI_EIRR_ER1                     *((volatile unsigned int*)(0x42600084UL))
#define bFM3_EXTI_EIRR_ER2                     *((volatile unsigned int*)(0x42600088UL))
#define bFM3_EXTI_EIRR_ER3                     *((volatile unsigned int*)(0x4260008CUL))
#define bFM3_EXTI_EIRR_ER4                     *((volatile unsigned int*)(0x42600090UL))
#define bFM3_EXTI_EIRR_ER5                     *((volatile unsigned int*)(0x42600094UL))
#define bFM3_EXTI_EIRR_ER6                     *((volatile unsigned int*)(0x42600098UL))
#define bFM3_EXTI_EIRR_ER7                     *((volatile unsigned int*)(0x4260009CUL))
#define bFM3_EXTI_EIRR_ER8                     *((volatile unsigned int*)(0x426000A0UL))
#define bFM3_EXTI_EIRR_ER9                     *((volatile unsigned int*)(0x426000A4UL))
#define bFM3_EXTI_EIRR_ER10                    *((volatile unsigned int*)(0x426000A8UL))
#define bFM3_EXTI_EIRR_ER11                    *((volatile unsigned int*)(0x426000ACUL))
#define bFM3_EXTI_EIRR_ER12                    *((volatile unsigned int*)(0x426000B0UL))
#define bFM3_EXTI_EIRR_ER13                    *((volatile unsigned int*)(0x426000B4UL))
#define bFM3_EXTI_EIRR_ER14                    *((volatile unsigned int*)(0x426000B8UL))
#define bFM3_EXTI_EIRR_ER15                    *((volatile unsigned int*)(0x426000BCUL))
#define bFM3_EXTI_EIRR_ER16                    *((volatile unsigned int*)(0x426000C0UL))
#define bFM3_EXTI_EIRR_ER17                    *((volatile unsigned int*)(0x426000C4UL))
#define bFM3_EXTI_EIRR_ER18                    *((volatile unsigned int*)(0x426000C8UL))
#define bFM3_EXTI_EIRR_ER19                    *((volatile unsigned int*)(0x426000CCUL))
#define bFM3_EXTI_EIRR_ER20                    *((volatile unsigned int*)(0x426000D0UL))
#define bFM3_EXTI_EIRR_ER21                    *((volatile unsigned int*)(0x426000D4UL))
#define bFM3_EXTI_EIRR_ER22                    *((volatile unsigned int*)(0x426000D8UL))
#define bFM3_EXTI_EIRR_ER23                    *((volatile unsigned int*)(0x426000DCUL))
#define bFM3_EXTI_EIRR_ER24                    *((volatile unsigned int*)(0x426000E0UL))
#define bFM3_EXTI_EIRR_ER25                    *((volatile unsigned int*)(0x426000E4UL))
#define bFM3_EXTI_EIRR_ER26                    *((volatile unsigned int*)(0x426000E8UL))
#define bFM3_EXTI_EIRR_ER27                    *((volatile unsigned int*)(0x426000ECUL))
#define bFM3_EXTI_EIRR_ER28                    *((volatile unsigned int*)(0x426000F0UL))
#define bFM3_EXTI_EIRR_ER29                    *((volatile unsigned int*)(0x426000F4UL))
#define bFM3_EXTI_EIRR_ER30                    *((volatile unsigned int*)(0x426000F8UL))
#define bFM3_EXTI_EIRR_ER31                    *((volatile unsigned int*)(0x426000FCUL))
#define bFM3_EXTI_EICL_ECL0                    *((volatile unsigned int*)(0x42600100UL))
#define bFM3_EXTI_EICL_ECL1                    *((volatile unsigned int*)(0x42600104UL))
#define bFM3_EXTI_EICL_ECL2                    *((volatile unsigned int*)(0x42600108UL))
#define bFM3_EXTI_EICL_ECL3                    *((volatile unsigned int*)(0x4260010CUL))
#define bFM3_EXTI_EICL_ECL4                    *((volatile unsigned int*)(0x42600110UL))
#define bFM3_EXTI_EICL_ECL5                    *((volatile unsigned int*)(0x42600114UL))
#define bFM3_EXTI_EICL_ECL6                    *((volatile unsigned int*)(0x42600118UL))
#define bFM3_EXTI_EICL_ECL7                    *((volatile unsigned int*)(0x4260011CUL))
#define bFM3_EXTI_EICL_ECL8                    *((volatile unsigned int*)(0x42600120UL))
#define bFM3_EXTI_EICL_ECL9                    *((volatile unsigned int*)(0x42600124UL))
#define bFM3_EXTI_EICL_ECL10                   *((volatile unsigned int*)(0x42600128UL))
#define bFM3_EXTI_EICL_ECL11                   *((volatile unsigned int*)(0x4260012CUL))
#define bFM3_EXTI_EICL_ECL12                   *((volatile unsigned int*)(0x42600130UL))
#define bFM3_EXTI_EICL_ECL13                   *((volatile unsigned int*)(0x42600134UL))
#define bFM3_EXTI_EICL_ECL14                   *((volatile unsigned int*)(0x42600138UL))
#define bFM3_EXTI_EICL_ECL15                   *((volatile unsigned int*)(0x4260013CUL))
#define bFM3_EXTI_EICL_ECL16                   *((volatile unsigned int*)(0x42600140UL))
#define bFM3_EXTI_EICL_ECL17                   *((volatile unsigned int*)(0x42600144UL))
#define bFM3_EXTI_EICL_ECL18                   *((volatile unsigned int*)(0x42600148UL))
#define bFM3_EXTI_EICL_ECL19                   *((volatile unsigned int*)(0x4260014CUL))
#define bFM3_EXTI_EICL_ECL20                   *((volatile unsigned int*)(0x42600150UL))
#define bFM3_EXTI_EICL_ECL21                   *((volatile unsigned int*)(0x42600154UL))
#define bFM3_EXTI_EICL_ECL22                   *((volatile unsigned int*)(0x42600158UL))
#define bFM3_EXTI_EICL_ECL23                   *((volatile unsigned int*)(0x4260015CUL))
#define bFM3_EXTI_EICL_ECL24                   *((volatile unsigned int*)(0x42600160UL))
#define bFM3_EXTI_EICL_ECL25                   *((volatile unsigned int*)(0x42600164UL))
#define bFM3_EXTI_EICL_ECL26                   *((volatile unsigned int*)(0x42600168UL))
#define bFM3_EXTI_EICL_ECL27                   *((volatile unsigned int*)(0x4260016CUL))
#define bFM3_EXTI_EICL_ECL28                   *((volatile unsigned int*)(0x42600170UL))
#define bFM3_EXTI_EICL_ECL29                   *((volatile unsigned int*)(0x42600174UL))
#define bFM3_EXTI_EICL_ECL30                   *((volatile unsigned int*)(0x42600178UL))
#define bFM3_EXTI_EICL_ECL31                   *((volatile unsigned int*)(0x4260017CUL))
#define bFM3_EXTI_ELVR_LA0                     *((volatile unsigned int*)(0x42600180UL))
#define bFM3_EXTI_ELVR_LB0                     *((volatile unsigned int*)(0x42600184UL))
#define bFM3_EXTI_ELVR_LA1                     *((volatile unsigned int*)(0x42600188UL))
#define bFM3_EXTI_ELVR_LB1                     *((volatile unsigned int*)(0x4260018CUL))
#define bFM3_EXTI_ELVR_LA2                     *((volatile unsigned int*)(0x42600190UL))
#define bFM3_EXTI_ELVR_LB2                     *((volatile unsigned int*)(0x42600194UL))
#define bFM3_EXTI_ELVR_LA3                     *((volatile unsigned int*)(0x42600198UL))
#define bFM3_EXTI_ELVR_LB3                     *((volatile unsigned int*)(0x4260019CUL))
#define bFM3_EXTI_ELVR_LA4                     *((volatile unsigned int*)(0x426001A0UL))
#define bFM3_EXTI_ELVR_LB4                     *((volatile unsigned int*)(0x426001A4UL))
#define bFM3_EXTI_ELVR_LA5                     *((volatile unsigned int*)(0x426001A8UL))
#define bFM3_EXTI_ELVR_LB5                     *((volatile unsigned int*)(0x426001ACUL))
#define bFM3_EXTI_ELVR_LA6                     *((volatile unsigned int*)(0x426001B0UL))
#define bFM3_EXTI_ELVR_LB6                     *((volatile unsigned int*)(0x426001B4UL))
#define bFM3_EXTI_ELVR_LA7                     *((volatile unsigned int*)(0x426001B8UL))
#define bFM3_EXTI_ELVR_LB7                     *((volatile unsigned int*)(0x426001BCUL))
#define bFM3_EXTI_ELVR_LA8                     *((volatile unsigned int*)(0x426001C0UL))
#define bFM3_EXTI_ELVR_LB8                     *((volatile unsigned int*)(0x426001C4UL))
#define bFM3_EXTI_ELVR_LA9                     *((volatile unsigned int*)(0x426001C8UL))
#define bFM3_EXTI_ELVR_LB9                     *((volatile unsigned int*)(0x426001CCUL))
#define bFM3_EXTI_ELVR_LA10                    *((volatile unsigned int*)(0x426001D0UL))
#define bFM3_EXTI_ELVR_LB10                    *((volatile unsigned int*)(0x426001D4UL))
#define bFM3_EXTI_ELVR_LA11                    *((volatile unsigned int*)(0x426001D8UL))
#define bFM3_EXTI_ELVR_LB11                    *((volatile unsigned int*)(0x426001DCUL))
#define bFM3_EXTI_ELVR_LA12                    *((volatile unsigned int*)(0x426001E0UL))
#define bFM3_EXTI_ELVR_LB12                    *((volatile unsigned int*)(0x426001E4UL))
#define bFM3_EXTI_ELVR_LA13                    *((volatile unsigned int*)(0x426001E8UL))
#define bFM3_EXTI_ELVR_LB13                    *((volatile unsigned int*)(0x426001ECUL))
#define bFM3_EXTI_ELVR_LA14                    *((volatile unsigned int*)(0x426001F0UL))
#define bFM3_EXTI_ELVR_LB14                    *((volatile unsigned int*)(0x426001F4UL))
#define bFM3_EXTI_ELVR_LA15                    *((volatile unsigned int*)(0x426001F8UL))
#define bFM3_EXTI_ELVR_LB15                    *((volatile unsigned int*)(0x426001FCUL))
#define bFM3_EXTI_ELVR_LA16                    *((volatile unsigned int*)(0x42600200UL))
#define bFM3_EXTI_ELVR_LB16                    *((volatile unsigned int*)(0x42600204UL))
#define bFM3_EXTI_ELVR_LA17                    *((volatile unsigned int*)(0x42600208UL))
#define bFM3_EXTI_ELVR_LB17                    *((volatile unsigned int*)(0x4260020CUL))
#define bFM3_EXTI_ELVR_LA18                    *((volatile unsigned int*)(0x42600210UL))
#define bFM3_EXTI_ELVR_LB18                    *((volatile unsigned int*)(0x42600214UL))
#define bFM3_EXTI_ELVR_LA19                    *((volatile unsigned int*)(0x42600218UL))
#define bFM3_EXTI_ELVR_LB19                    *((volatile unsigned int*)(0x4260021CUL))
#define bFM3_EXTI_ELVR_LA20                    *((volatile unsigned int*)(0x42600220UL))
#define bFM3_EXTI_ELVR_LB20                    *((volatile unsigned int*)(0x42600224UL))
#define bFM3_EXTI_ELVR_LA21                    *((volatile unsigned int*)(0x42600228UL))
#define bFM3_EXTI_ELVR_LB21                    *((volatile unsigned int*)(0x4260022CUL))
#define bFM3_EXTI_ELVR_LA22                    *((volatile unsigned int*)(0x42600230UL))
#define bFM3_EXTI_ELVR_LB22                    *((volatile unsigned int*)(0x42600234UL))
#define bFM3_EXTI_ELVR_LA23                    *((volatile unsigned int*)(0x42600238UL))
#define bFM3_EXTI_ELVR_LB23                    *((volatile unsigned int*)(0x4260023CUL))
#define bFM3_EXTI_ELVR_LA24                    *((volatile unsigned int*)(0x42600240UL))
#define bFM3_EXTI_ELVR_LB24                    *((volatile unsigned int*)(0x42600244UL))
#define bFM3_EXTI_ELVR_LA25                    *((volatile unsigned int*)(0x42600248UL))
#define bFM3_EXTI_ELVR_LB25                    *((volatile unsigned int*)(0x4260024CUL))
#define bFM3_EXTI_ELVR_LA26                    *((volatile unsigned int*)(0x42600250UL))
#define bFM3_EXTI_ELVR_LB26                    *((volatile unsigned int*)(0x42600254UL))
#define bFM3_EXTI_ELVR_LA27                    *((volatile unsigned int*)(0x42600258UL))
#define bFM3_EXTI_ELVR_LB27                    *((volatile unsigned int*)(0x4260025CUL))
#define bFM3_EXTI_ELVR_LA28                    *((volatile unsigned int*)(0x42600260UL))
#define bFM3_EXTI_ELVR_LB28                    *((volatile unsigned int*)(0x42600264UL))
#define bFM3_EXTI_ELVR_LA29                    *((volatile unsigned int*)(0x42600268UL))
#define bFM3_EXTI_ELVR_LB29                    *((volatile unsigned int*)(0x4260026CUL))
#define bFM3_EXTI_ELVR_LA30                    *((volatile unsigned int*)(0x42600270UL))
#define bFM3_EXTI_ELVR_LB30                    *((volatile unsigned int*)(0x42600274UL))
#define bFM3_EXTI_ELVR_LA31                    *((volatile unsigned int*)(0x42600278UL))
#define bFM3_EXTI_ELVR_LB31                    *((volatile unsigned int*)(0x4260027CUL))
#define bFM3_EXTI_NMIRR_NR0                    *((volatile unsigned int*)(0x42600280UL))
#define bFM3_EXTI_NMICL_NCL0                   *((volatile unsigned int*)(0x42600300UL))

