AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
#define bFM3_INTREQ_DRQSEL1_DRQSEL10           *((volatile unsigned int*)(0x42624000UL))
#define bFM3_INTREQ_DRQSEL1_DRQSEL11           *((volatile unsigned int*)(0x42624004UL))
#define bFM3_INTREQ_DRQSEL1_DRQSEL12           *((volatile unsigned int*)(0x42624008UL))
#define bFM3_INTREQ_DRQSEL1_DRQSEL13           *((volatile unsigned int*)(0x4262400CUL))
#define bFM3_INTREQ_DRQSEL1_DRQSEL14           *((volatile unsigned int*)(0x42624010UL))
#define bFM3_INTREQ_DQESEL_ESEL100             *((volatile unsigned int*)(0x42624080UL))
#define bFM3_INTREQ_DQESEL_ESEL101             *((volatile unsigned int*)(0x42624084UL))
#define bFM3_INTREQ_DQESEL_ESEL102             *((volatile unsigned int*)(0x42624088UL))
#define bFM3_INTREQ_DQESEL_ESEL103             *((volatile unsigned int*)(0x4262408CUL))
#define bFM3_INTREQ_DQESEL_ESEL110             *((volatile unsigned int*)(0x42624090UL))
#define bFM3_INTREQ_DQESEL_ESEL111             *((volatile unsigned int*)(0x42624094UL))
#define bFM3_INTREQ_DQESEL_ESEL112             *((volatile unsigned int*)(0x42624098UL))
#define bFM3_INTREQ_DQESEL_ESEL113             *((volatile unsigned int*)(0x4262409CUL))
#define bFM3_INTREQ_DQESEL_ESEL240             *((volatile unsigned int*)(0x426240A0UL))
#define bFM3_INTREQ_DQESEL_ESEL241             *((volatile unsigned int*)(0x426240A4UL))
#define bFM3_INTREQ_DQESEL_ESEL242             *((volatile unsigned int*)(0x426240A8UL))
#define bFM3_INTREQ_DQESEL_ESEL243             *((volatile unsigned int*)(0x426240ACUL))
#define bFM3_INTREQ_DQESEL_ESEL250             *((volatile unsigned int*)(0x426240B0UL))
#define bFM3_INTREQ_DQESEL_ESEL251             *((volatile unsigned int*)(0x426240B4UL))
#define bFM3_INTREQ_DQESEL_ESEL252             *((volatile unsigned int*)(0x426240B8UL))
#define bFM3_INTREQ_DQESEL_ESEL253             *((volatile unsigned int*)(0x426240BCUL))
#define bFM3_INTREQ_DQESEL_ESEL260             *((volatile unsigned int*)(0x426240C0UL))
#define bFM3_INTREQ_DQESEL_ESEL261             *((volatile unsigned int*)(0x426240C4UL))
#define bFM3_INTREQ_DQESEL_ESEL262             *((volatile unsigned int*)(0x426240C8UL))
#define bFM3_INTREQ_DQESEL_ESEL263             *((volatile unsigned int*)(0x426240CCUL))
#define bFM3_INTREQ_DQESEL_ESEL270             *((volatile unsigned int*)(0x426240D0UL))
#define bFM3_INTREQ_DQESEL_ESEL271             *((volatile unsigned int*)(0x426240D4UL))
#define bFM3_INTREQ_DQESEL_ESEL272             *((volatile unsigned int*)(0x426240D8UL))
#define bFM3_INTREQ_DQESEL_ESEL273             *((volatile unsigned int*)(0x426240DCUL))
#define bFM3_INTREQ_DQESEL_ESEL300             *((volatile unsigned int*)(0x426240E0UL))
#define bFM3_INTREQ_DQESEL_ESEL301             *((volatile unsigned int*)(0x426240E4UL))
#define bFM3_INTREQ_DQESEL_ESEL302             *((volatile unsigned int*)(0x426240E8UL))
#define bFM3_INTREQ_DQESEL_ESEL303             *((volatile unsigned int*)(0x426240ECUL))
#define bFM3_INTREQ_DQESEL_ESEL310             *((volatile unsigned int*)(0x426240F0UL))
#define bFM3_INTREQ_DQESEL_ESEL311             *((volatile unsigned int*)(0x426240F4UL))
#define bFM3_INTREQ_DQESEL_ESEL312             *((volatile unsigned int*)(0x426240F8UL))
#define bFM3_INTREQ_DQESEL_ESEL313             *((volatile unsigned int*)(0x426240FCUL))
#define bFM3_INTREQ_ODDPKS1_ODDPKS10           *((volatile unsigned char*)(0x426241E0UL))
#define bFM3_INTREQ_ODDPKS1_ODDPKS11           *((volatile unsigned char*)(0x426241E4UL))
#define bFM3_INTREQ_ODDPKS1_ODDPKS12           *((volatile unsigned char*)(0x426241E8UL))
#define bFM3_INTREQ_ODDPKS1_ODDPKS13           *((volatile unsigned char*)(0x426241ECUL))
#define bFM3_INTREQ_ODDPKS1_ODDPKS14           *((volatile unsigned char*)(0x426241F0UL))

/* General purpose I/O registers */
#define bFM3_GPIO_PFR0_P0                      *((volatile unsigned int*)(0x42660000UL))
#define bFM3_GPIO_PFR0_P1                      *((volatile unsigned int*)(0x42660004UL))
#define bFM3_GPIO_PFR0_P2                      *((volatile unsigned int*)(0x42660008UL))
#define bFM3_GPIO_PFR0_P3                      *((volatile unsigned int*)(0x4266000CUL))
#define bFM3_GPIO_PFR0_P4                      *((volatile unsigned int*)(0x42660010UL))
#define bFM3_GPIO_PFR0_P5                      *((volatile unsigned int*)(0x42660014UL))
#define bFM3_GPIO_PFR0_P6                      *((volatile unsigned int*)(0x42660018UL))
#define bFM3_GPIO_PFR0_P7                      *((volatile unsigned int*)(0x4266001CUL))
#define bFM3_GPIO_PFR0_P8                      *((volatile unsigned int*)(0x42660020UL))
#define bFM3_GPIO_PFR0_P9                      *((volatile unsigned int*)(0x42660024UL))
#define bFM3_GPIO_PFR1_P0                      *((volatile unsigned int*)(0x42660080UL))
#define bFM3_GPIO_PFR1_P1                      *((volatile unsigned int*)(0x42660084UL))
#define bFM3_GPIO_PFR1_P2                      *((volatile unsigned int*)(0x42660088UL))
#define bFM3_GPIO_PFR1_P3                      *((volatile unsigned int*)(0x4266008CUL))
#define bFM3_GPIO_PFR1_P4                      *((volatile unsigned int*)(0x42660090UL))
#define bFM3_GPIO_PFR1_P5                      *((volatile unsigned int*)(0x42660094UL))
#define bFM3_GPIO_PFR1_P6                      *((volatile unsigned int*)(0x42660098UL))
#define bFM3_GPIO_PFR1_P7                      *((volatile unsigned int*)(0x4266009CUL))
#define bFM3_GPIO_PFR1_P8                      *((volatile unsigned int*)(0x426600A0UL))
#define bFM3_GPIO_PFR1_P9                      *((volatile unsigned int*)(0x426600A4UL))
#define bFM3_GPIO_PFR1_PA                      *((volatile unsigned int*)(0x426600A8UL))
#define bFM3_GPIO_PFR1_PB                      *((volatile unsigned int*)(0x426600ACUL))
#define bFM3_GPIO_PFR1_PC                      *((volatile unsigned int*)(0x426600B0UL))
#define bFM3_GPIO_PFR1_PD                      *((volatile unsigned int*)(0x426600B4UL))
#define bFM3_GPIO_PFR1_PE                      *((volatile unsigned int*)(0x426600B8UL))
#define bFM3_GPIO_PFR1_PF                      *((volatile unsigned int*)(0x426600BCUL))
#define bFM3_GPIO_PFR2_P0                      *((volatile unsigned int*)(0x42660100UL))
#define bFM3_GPIO_PFR2_P1                      *((volatile unsigned int*)(0x42660104UL))
#define bFM3_GPIO_PFR2_P2                      *((volatile unsigned int*)(0x42660108UL))
#define bFM3_GPIO_PFR2_P3                      *((volatile unsigned int*)(0x4266010CUL))
#define bFM3_GPIO_PFR2_P4                      *((volatile unsigned int*)(0x42660110UL))
#define bFM3_GPIO_PFR2_P5                      *((volatile unsigned int*)(0x42660114UL))
#define bFM3_GPIO_PFR2_P6                      *((volatile unsigned int*)(0x42660118UL))
#define bFM3_GPIO_PFR2_P7                      *((volatile unsigned int*)(0x4266011CUL))
#define bFM3_GPIO_PFR2_P8                      *((volatile unsigned int*)(0x42660120UL))
#define bFM3_GPIO_PFR2_P9                      *((volatile unsigned int*)(0x42660124UL))
#define bFM3_GPIO_PFR3_P6                      *((volatile unsigned int*)(0x42660198UL))
#define bFM3_GPIO_PFR3_P7                      *((volatile unsigned int*)(0x4266019CUL))
#define bFM3_GPIO_PFR3_P8                      *((volatile unsigned int*)(0x426601A0UL))
#define bFM3_GPIO_PFR3_P9                      *((volatile unsigned int*)(0x426601A4UL))
#define bFM3_GPIO_PFR3_PA                      *((volatile unsigned int*)(0x426601A8UL))
#define bFM3_GPIO_PFR3_PB                      *((volatile unsigned int*)(0x426601ACUL))
#define bFM3_GPIO_PFR3_PC                      *((volatile unsigned int*)(0x426601B0UL))
#define bFM3_GPIO_PFR3_PD                      *((volatile unsigned int*)(0x426601B4UL))
#define bFM3_GPIO_PFR3_PE                      *((volatile unsigned int*)(0x426601B8UL))
#define bFM3_GPIO_PFR3_PF                      *((volatile unsigned int*)(0x426601BCUL))
#define bFM3_GPIO_PFR4_P0                      *((volatile unsigned int*)(0x42660200UL))
#define bFM3_GPIO_PFR4_P1                      *((volatile unsigned int*)(0x42660204UL))
#define bFM3_GPIO_PFR4_P2                      *((volatile unsigned int*)(0x42660208UL))
#define bFM3_GPIO_PFR4_P3                      *((volatile unsigned int*)(0x4266020CUL))
#define bFM3_GPIO_PFR4_P4                      *((volatile unsigned int*)(0x42660210UL))
#define bFM3_GPIO_PFR4_P5                      *((volatile unsigned int*)(0x42660214UL))
#define bFM3_GPIO_PFR4_P6                      *((volatile unsigned int*)(0x42660218UL))
#define bFM3_GPIO_PFR4_P7                      *((volatile unsigned int*)(0x4266021CUL))
#define bFM3_GPIO_PFR4_P8                      *((volatile unsigned int*)(0x42660220UL))
#define bFM3_GPIO_PFR4_P9                      *((volatile unsigned int*)(0x42660224UL))
#define bFM3_GPIO_PFR4_PA                      *((volatile unsigned int*)(0x42660228UL))
#define bFM3_GPIO_PFR4_PB                      *((volatile unsigned int*)(0x4266022CUL))
#define bFM3_GPIO_PFR4_PC                      *((volatile unsigned int*)(0x42660230UL))
#define bFM3_GPIO_PFR4_PD                      *((volatile unsigned int*)(0x42660234UL))
#define bFM3_GPIO_PFR4_PE                      *((volatile unsigned int*)(0x42660238UL))
#define bFM3_GPIO_PFR5_P0                      *((volatile unsigned int*)(0x42660280UL))
#define bFM3_GPIO_PFR5_P1                      *((volatile unsigned int*)(0x42660284UL))
#define bFM3_GPIO_PFR5_P2                      *((volatile unsigned int*)(0x42660288UL))
#define bFM3_GPIO_PFR5_P3                      *((volatile unsigned int*)(0x4266028CUL))
#define bFM3_GPIO_PFR5_P4                      *((volatile unsigned int*)(0x42660290UL))
#define bFM3_GPIO_PFR5_P5                      *((volatile unsigned int*)(0x42660294UL))
#define bFM3_GPIO_PFR5_P6                      *((volatile unsigned int*)(0x42660298UL))
#define bFM3_GPIO_PFR5_P7                      *((volatile unsigned int*)(0x4266029CUL))
#define bFM3_GPIO_PFR5_P8                      *((volatile unsigned int*)(0x426602A0UL))
#define bFM3_GPIO_PFR5_P9                      *((volatile unsigned int*)(0x426602A4UL))
#define bFM3_GPIO_PFR5_PA                      *((volatile unsigned int*)(0x426602A8UL))
#define bFM3_GPIO_PFR5_PB                      *((volatile unsigned int*)(0x426602ACUL))
#define bFM3_GPIO_PFR6_P0                      *((volatile unsigned int*)(0x42660300UL))
#define bFM3_GPIO_PFR6_P1                      *((volatile unsigned int*)(0x42660304UL))
#define bFM3_GPIO_PFR6_P2                      *((volatile unsigned int*)(0x42660308UL))
#define bFM3_GPIO_PFR7_P0                      *((volatile unsigned int*)(0x42660380UL))
#define bFM3_GPIO_PFR7_P1                      *((volatile unsigned int*)(0x42660384UL))
#define bFM3_GPIO_PFR7_P2                      *((volatile unsigned int*)(0x42660388UL))
#define bFM3_GPIO_PFR7_P3                      *((volatile unsigned int*)(0x4266038CUL))
#define bFM3_GPIO_PFR7_P4                      *((volatile unsigned int*)(0x42660390UL))
#define bFM3_GPIO_PFR7_P5                      *((volatile unsigned int*)(0x42660394UL))
#define bFM3_GPIO_PFR7_P6                      *((volatile unsigned int*)(0x42660398UL))
#define bFM3_GPIO_PFR7_P7                      *((volatile unsigned int*)(0x4266039CUL))
#define bFM3_GPIO_PFR7_P8                      *((volatile unsigned int*)(0x426603A0UL))
#define bFM3_GPIO_PFR7_P9                      *((volatile unsigned int*)(0x426603A4UL))
#define bFM3_GPIO_PFR7_PA                      *((volatile unsigned int*)(0x426603A8UL))
#define bFM3_GPIO_PFR8_P0                      *((volatile unsigned int*)(0x42660400UL))
#define bFM3_GPIO_PFR8_P1                      *((volatile unsigned int*)(0x42660404UL))
#define bFM3_GPIO_PFR8_P2                      *((volatile unsigned int*)(0x42660408UL))
#define bFM3_GPIO_PFR8_P3                      *((volatile unsigned int*)(0x4266040CUL))
#define bFM3_GPIO_PFRA_P0                      *((volatile unsigned int*)(0x42660500UL))
#define bFM3_GPIO_PFRA_P1                      *((volatile unsigned int*)(0x42660504UL))
#define bFM3_GPIO_PFRA_P2                      *((volatile unsigned int*)(0x42660508UL))
#define bFM3_GPIO_PFRA_P3                      *((volatile unsigned int*)(0x4266050CUL))
#define bFM3_GPIO_PFRA_P4                      *((volatile unsigned int*)(0x42660510UL))
#define bFM3_GPIO_PFRA_P5                      *((volatile unsigned int*)(0x42660514UL))
#define bFM3_GPIO_PFRC_P0                      *((volatile unsigned int*)(0x42660600UL))
#define bFM3_GPIO_PFRC_P1                      *((volatile unsigned int*)(0x42660604UL))
#define bFM3_GPIO_PFRC_P2                      *((volatile unsigned int*)(0x42660608UL))
#define bFM3_GPIO_PFRC_P3                      *((volatile unsigned int*)(0x4266060CUL))
#define bFM3_GPIO_PFRC_P4                      *((volatile unsigned int*)(0x42660610UL))
#define bFM3_GPIO_PFRC_P5                      *((volatile unsigned int*)(0x42660614UL))
#define bFM3_GPIO_PFRC_P6                      *((volatile unsigned int*)(0x42660618UL))
#define bFM3_GPIO_PFRC_P7                      *((volatile unsigned int*)(0x4266061CUL))
#define bFM3_GPIO_PFRC_P8                      *((volatile unsigned int*)(0x42660620UL))
#define bFM3_GPIO_PFRC_P9                      *((volatile unsigned int*)(0x42660624UL))
#define bFM3_GPIO_PFRC_PA                      *((volatile unsigned int*)(0x42660628UL))
#define bFM3_GPIO_PFRC_PB                      *((volatile unsigned int*)(0x4266062CUL))
#define bFM3_GPIO_PFRC_PC                      *((volatile unsigned int*)(0x42660630UL))
#define bFM3_GPIO_PFRC_PD                      *((volatile unsigned int*)(0x42660634UL))
#define bFM3_GPIO_PFRC_PE                      *((volatile unsigned int*)(0x42660638UL))
#define bFM3_GPIO_PFRC_PF                      *((volatile unsigned int*)(0x4266063CUL))
#define bFM3_GPIO_PFRD_P0                      *((volatile unsigned int*)(0x42660680UL))
#define bFM3_GPIO_PFRD_P1                      *((volatile unsigned int*)(0x42660684UL))
#define bFM3_GPIO_PFRD_P2                      *((volatile unsigned int*)(0x42660688UL))
#define bFM3_GPIO_PFRD_P3                      *((volatile unsigned int*)(0x4266068CUL))
#define bFM3_GPIO_PFRE_P0                      *((volatile unsigned int*)(0x42660700UL))
#define bFM3_GPIO_PFRE_P2                      *((volatile unsigned int*)(0x42660708UL))
#define bFM3_GPIO_PFRE_P3                      *((volatile unsigned int*)(0x4266070CUL))
#define bFM3_GPIO_PFRF_P5                      *((volatile unsigned int*)(0x42660794UL))
#define bFM3_GPIO_PFRF_P6                      *((volatile unsigned int*)(0x42660798UL))
#define bFM3_GPIO_PCR0_P0                      *((volatile unsigned int*)(0x42662000UL))
#define bFM3_GPIO_PCR0_P1                      *((volatile unsigned int*)(0x42662004UL))
#define bFM3_GPIO_PCR0_P2                      *((volatile unsigned int*)(0x42662008UL))
#define bFM3_GPIO_PCR0_P3                      *((volatile unsigned int*)(0x4266200CUL))
#define bFM3_GPIO_PCR0_P4                      *((volatile unsigned int*)(0x42662010UL))
#define bFM3_GPIO_PCR0_P5                      *((volatile unsigned int*)(0x42662014UL))
#define bFM3_GPIO_PCR0_P6                      *((volatile unsigned int*)(0x42662018UL))
#define bFM3_GPIO_PCR0_P7                      *((volatile unsigned int*)(0x4266201CUL))
#define bFM3_GPIO_PCR0_P8                      *((volatile unsigned int*)(0x42662020UL))
#define bFM3_GPIO_PCR0_P9                      *((volatile unsigned int*)(0x42662024UL))
#define bFM3_GPIO_PCR1_P0                      *((volatile unsigned int*)(0x42662080UL))
#define bFM3_GPIO_PCR1_P1                      *((volatile unsigned int*)(0x42662084UL))
#define bFM3_GPIO_PCR1_P2                      *((volatile unsigned int*)(0x42662088UL))
#define bFM3_GPIO_PCR1_P3                      *((volatile unsigned int*)(0x4266208CUL))
#define bFM3_GPIO_PCR1_P4                      *((volatile unsigned int*)(0x42662090UL))
#define bFM3_GPIO_PCR1_P5                      *((volatile unsigned int*)(0x42662094UL))
#define bFM3_GPIO_PCR1_P6                      *((volatile unsigned int*)(0x42662098UL))
#define bFM3_GPIO_PCR1_P7                      *((volatile unsigned int*)(0x4266209CUL))
#define bFM3_GPIO_PCR1_P8                      *((volatile unsigned int*)(0x426620A0UL))
#define bFM3_GPIO_PCR1_P9                      *((volatile unsigned int*)(0x426620A4UL))
#define bFM3_GPIO_PCR1_PA                      *((volatile unsigned int*)(0x426620A8UL))
#define bFM3_GPIO_PCR1_PB                      *((volatile unsigned int*)(0x426620ACUL))
#define bFM3_GPIO_PCR1_PC                      *((volatile unsigned int*)(0x426620B0UL))
#define bFM3_GPIO_PCR1_PD                      *((volatile unsigned int*)(0x426620B4UL))
#define bFM3_GPIO_PCR1_PE                      *((volatile unsigned int*)(0x426620B8UL))
#define bFM3_GPIO_PCR1_PF                      *((volatile unsigned int*)(0x426620BCUL))
#define bFM3_GPIO_PCR2_P0                      *((volatile unsigned int*)(0x42662100UL))
#define bFM3_GPIO_PCR2_P1                      *((volatile unsigned int*)(0x42662104UL))
#define bFM3_GPIO_PCR2_P2                      *((volatile unsigned int*)(0x42662108UL))
#define bFM3_GPIO_PCR2_P3                      *((volatile unsigned int*)(0x4266210CUL))
#define bFM3_GPIO_PCR2_P4                      *((volatile unsigned int*)(0x42662110UL))
#define bFM3_GPIO_PCR2_P5                      *((volatile unsigned int*)(0x42662114UL))
#define bFM3_GPIO_PCR2_P6                      *((volatile unsigned int*)(0x42662118UL))
#define bFM3_GPIO_PCR2_P7                      *((volatile unsigned int*)(0x4266211CUL))
#define bFM3_GPIO_PCR2_P8                      *((volatile unsigned int*)(0x42662120UL))
#define bFM3_GPIO_PCR2_P9                      *((volatile unsigned int*)(0x42662124UL))
#define bFM3_GPIO_PCR3_P6                      *((volatile unsigned int*)(0x42662198UL))
#define bFM3_GPIO_PCR3_P7                      *((volatile unsigned int*)(0x4266219CUL))
#define bFM3_GPIO_PCR3_P8                      *((volatile unsigned int*)(0x426621A0UL))
#define bFM3_GPIO_PCR3_P9                      *((volatile unsigned int*)(0x426621A4UL))
#define bFM3_GPIO_PCR3_PA                      *((volatile unsigned int*)(0x426621A8UL))
#define bFM3_GPIO_PCR3_PB                      *((volatile unsigned int*)(0x426621ACUL))
#define bFM3_GPIO_PCR3_PC                      *((volatile unsigned int*)(0x426621B0UL))
#define bFM3_GPIO_PCR3_PD                      *((volatile unsigned int*)(0x426621B4UL))
#define bFM3_GPIO_PCR3_PE                      *((volatile unsigned int*)(0x426621B8UL))
#define bFM3_GPIO_PCR3_PF                      *((volatile unsigned int*)(0x426621BCUL))
#define bFM3_GPIO_PCR4_P0                      *((volatile unsigned int*)(0x42662200UL))
#define bFM3_GPIO_PCR4_P1                      *((volatile unsigned int*)(0x42662204UL))
#define bFM3_GPIO_PCR4_P2                      *((volatile unsigned int*)(0x42662208UL))
#define bFM3_GPIO_PCR4_P3                      *((volatile unsigned int*)(0x4266220CUL))
#define bFM3_GPIO_PCR4_P4                      *((volatile unsigned int*)(0x42662210UL))
#define bFM3_GPIO_PCR4_P5                      *((volatile unsigned int*)(0x42662214UL))
#define bFM3_GPIO_PCR4_P6                      *((volatile unsigned int*)(0x42662218UL))
#define bFM3_GPIO_PCR4_P7                      *((volatile unsigned int*)(0x4266221CUL))
#define bFM3_GPIO_PCR4_P8                      *((volatile unsigned int*)(0x42662220UL))
#define bFM3_GPIO_PCR4_P9                      *((volatile unsigned int*)(0x42662224UL))
#define bFM3_GPIO_PCR4_PA                      *((volatile unsigned int*)(0x42662228UL))
#define bFM3_GPIO_PCR4_PB                      *((volatile unsigned int*)(0x4266222CUL))
#define bFM3_GPIO_PCR4_PC                      *((volatile unsigned int*)(0x42662230UL))
#define bFM3_GPIO_PCR4_PD                      *((volatile unsigned int*)(0x42662234UL))
#define bFM3_GPIO_PCR4_PE                      *((volatile unsigned int*)(0x42662238UL))
#define bFM3_GPIO_PCR5_P0                      *((volatile unsigned int*)(0x42662280UL))
#define bFM3_GPIO_PCR5_P1                      *((volatile unsigned int*)(0x42662284UL))
#define bFM3_GPIO_PCR5_P2                      *((volatile unsigned int*)(0x42662288UL))
#define bFM3_GPIO_PCR5_P3                      *((volatile unsigned int*)(0x4266228CUL))
#define bFM3_GPIO_PCR5_P4                      *((volatile unsigned int*)(0x42662290UL))
#define bFM3_GPIO_PCR5_P5                      *((volatile unsigned int*)(0x42662294UL))
#define bFM3_GPIO_PCR5_P6                      *((volatile unsigned int*)(0x42662298UL))
#define bFM3_GPIO_PCR5_P7                      *((volatile unsigned int*)(0x4266229CUL))
#define bFM3_GPIO_PCR5_P8                      *((volatile unsigned int*)(0x426622A0UL))
#define bFM3_GPIO_PCR5_P9                      *((volatile unsigned int*)(0x426622A4UL))
#define bFM3_GPIO_PCR5_PA                      *((volatile unsigned int*)(0x426622A8UL))
#define bFM3_GPIO_PCR5_PB                      *((volatile unsigned int*)(0x426622ACUL))
#define bFM3_GPIO_PCR6_P0                      *((volatile unsigned int*)(0x42662300UL))
#define bFM3_GPIO_PCR6_P1                      *((volatile unsigned int*)(0x42662304UL))
#define bFM3_GPIO_PCR6_P2                      *((volatile unsigned int*)(0x42662308UL))
#define bFM3_GPIO_PCR7_P0                      *((volatile unsigned int*)(0x42662380UL))
#define bFM3_GPIO_PCR7_P1                      *((volatile unsigned int*)(0x42662384UL))
#define bFM3_GPIO_PCR7_P2                      *((volatile unsigned int*)(0x42662388UL))
#define bFM3_GPIO_PCR7_P3                      *((volatile unsigned int*)(0x4266238CUL))
#define bFM3_GPIO_PCR7_P4                      *((volatile unsigned int*)(0x42662390UL))
#define bFM3_GPIO_PCR7_P5                      *((volatile unsigned int*)(0x42662394UL))
#define bFM3_GPIO_PCR7_P6                      *((volatile unsigned int*)(0x42662398UL))
#define bFM3_GPIO_PCR7_P7                      *((volatile unsigned int*)(0x4266239CUL))
#define bFM3_GPIO_PCR7_P8                      *((volatile unsigned int*)(0x426623A0UL))
#define bFM3_GPIO_PCR7_P9                      *((volatile unsigned int*)(0x426623A4UL))
#define bFM3_GPIO_PCR7_PA                      *((volatile unsigned int*)(0x426623A8UL))
#define bFM3_GPIO_PCRA_P0                      *((volatile unsigned int*)(0x42662500UL))
#define bFM3_GPIO_PCRA_P1                      *((volatile unsigned int*)(0x42662504UL))
#define bFM3_GPIO_PCRA_P2                      *((volatile unsigned int*)(0x42662508UL))
#define bFM3_GPIO_PCRA_P3                      *((volatile unsigned int*)(0x4266250CUL))
#define bFM3_GPIO_PCRA_P4                      *((volatile unsigned int*)(0x42662510UL))
#define bFM3_GPIO_PCRA_P5                      *((volatile unsigned int*)(0x42662514UL))
#define bFM3_GPIO_PCRC_P0                      *((volatile unsigned int*)(0x42662600UL))
#define bFM3_GPIO_PCRC_P1                      *((volatile unsigned int*)(0x42662604UL))
#define bFM3_GPIO_PCRC_P2                      *((volatile unsigned int*)(0x42662608UL))
#define bFM3_GPIO_PCRC_P3                      *((volatile unsigned int*)(0x4266260CUL))
#define bFM3_GPIO_PCRC_P4                      *((volatile unsigned int*)(0x42662610UL))
#define bFM3_GPIO_PCRC_P5                      *((volatile unsigned int*)(0x42662614UL))
#define bFM3_GPIO_PCRC_P6                      *((volatile unsigned int*)(0x42662618UL))
#define bFM3_GPIO_PCRC_P7                      *((volatile unsigned int*)(0x4266261CUL))
#define bFM3_GPIO_PCRC_P8                      *((volatile unsigned int*)(0x42662620UL))
#define bFM3_GPIO_PCRC_P9                      *((volatile unsigned int*)(0x42662624UL))
#define bFM3_GPIO_PCRC_PA                      *((volatile unsigned int*)(0x42662628UL))
#define bFM3_GPIO_PCRC_PB                      *((volatile unsigned int*)(0x4266262CUL))
