AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
#define bFM3_ETHERNET_MAC0_MAR5H_A38           *((volatile unsigned int*)(0x42C80D18UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A39           *((volatile unsigned int*)(0x42C80D1CUL))
#define bFM3_ETHERNET_MAC0_MAR5H_A40           *((volatile unsigned int*)(0x42C80D20UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A41           *((volatile unsigned int*)(0x42C80D24UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A42           *((volatile unsigned int*)(0x42C80D28UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A43           *((volatile unsigned int*)(0x42C80D2CUL))
#define bFM3_ETHERNET_MAC0_MAR5H_A44           *((volatile unsigned int*)(0x42C80D30UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A45           *((volatile unsigned int*)(0x42C80D34UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A46           *((volatile unsigned int*)(0x42C80D38UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A47           *((volatile unsigned int*)(0x42C80D3CUL))
#define bFM3_ETHERNET_MAC0_MAR5H_MBC0          *((volatile unsigned int*)(0x42C80D60UL))
#define bFM3_ETHERNET_MAC0_MAR5H_MBC1          *((volatile unsigned int*)(0x42C80D64UL))
#define bFM3_ETHERNET_MAC0_MAR5H_MBC2          *((volatile unsigned int*)(0x42C80D68UL))
#define bFM3_ETHERNET_MAC0_MAR5H_MBC3          *((volatile unsigned int*)(0x42C80D6CUL))
#define bFM3_ETHERNET_MAC0_MAR5H_MBC4          *((volatile unsigned int*)(0x42C80D70UL))
#define bFM3_ETHERNET_MAC0_MAR5H_MBC5          *((volatile unsigned int*)(0x42C80D74UL))
#define bFM3_ETHERNET_MAC0_MAR5H_SA            *((volatile unsigned int*)(0x42C80D78UL))
#define bFM3_ETHERNET_MAC0_MAR5H_AE            *((volatile unsigned int*)(0x42C80D7CUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A0            *((volatile unsigned int*)(0x42C80D80UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A1            *((volatile unsigned int*)(0x42C80D84UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A2            *((volatile unsigned int*)(0x42C80D88UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A3            *((volatile unsigned int*)(0x42C80D8CUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A4            *((volatile unsigned int*)(0x42C80D90UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A5            *((volatile unsigned int*)(0x42C80D94UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A6            *((volatile unsigned int*)(0x42C80D98UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A7            *((volatile unsigned int*)(0x42C80D9CUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A8            *((volatile unsigned int*)(0x42C80DA0UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A9            *((volatile unsigned int*)(0x42C80DA4UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A10           *((volatile unsigned int*)(0x42C80DA8UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A11           *((volatile unsigned int*)(0x42C80DACUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A12           *((volatile unsigned int*)(0x42C80DB0UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A13           *((volatile unsigned int*)(0x42C80DB4UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A14           *((volatile unsigned int*)(0x42C80DB8UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A15           *((volatile unsigned int*)(0x42C80DBCUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A16           *((volatile unsigned int*)(0x42C80DC0UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A17           *((volatile unsigned int*)(0x42C80DC4UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A18           *((volatile unsigned int*)(0x42C80DC8UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A19           *((volatile unsigned int*)(0x42C80DCCUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A20           *((volatile unsigned int*)(0x42C80DD0UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A21           *((volatile unsigned int*)(0x42C80DD4UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A22           *((volatile unsigned int*)(0x42C80DD8UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A23           *((volatile unsigned int*)(0x42C80DDCUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A24           *((volatile unsigned int*)(0x42C80DE0UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A25           *((volatile unsigned int*)(0x42C80DE4UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A26           *((volatile unsigned int*)(0x42C80DE8UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A27           *((volatile unsigned int*)(0x42C80DECUL))
#define bFM3_ETHERNET_MAC0_MAR5L_A28           *((volatile unsigned int*)(0x42C80DF0UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A29           *((volatile unsigned int*)(0x42C80DF4UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A30           *((volatile unsigned int*)(0x42C80DF8UL))
#define bFM3_ETHERNET_MAC0_MAR5L_A31           *((volatile unsigned int*)(0x42C80DFCUL))
#define bFM3_ETHERNET_MAC0_MAR6H_A32           *((volatile unsigned int*)(0x42C80E00UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A33           *((volatile unsigned int*)(0x42C80E04UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A34           *((volatile unsigned int*)(0x42C80E08UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A35           *((volatile unsigned int*)(0x42C80E0CUL))
#define bFM3_ETHERNET_MAC0_MAR6H_A36           *((volatile unsigned int*)(0x42C80E10UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A37           *((volatile unsigned int*)(0x42C80E14UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A38           *((volatile unsigned int*)(0x42C80E18UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A39           *((volatile unsigned int*)(0x42C80E1CUL))
#define bFM3_ETHERNET_MAC0_MAR6H_A40           *((volatile unsigned int*)(0x42C80E20UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A41           *((volatile unsigned int*)(0x42C80E24UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A42           *((volatile unsigned int*)(0x42C80E28UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A43           *((volatile unsigned int*)(0x42C80E2CUL))
#define bFM3_ETHERNET_MAC0_MAR6H_A44           *((volatile unsigned int*)(0x42C80E30UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A45           *((volatile unsigned int*)(0x42C80E34UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A46           *((volatile unsigned int*)(0x42C80E38UL))
#define bFM3_ETHERNET_MAC0_MAR6H_A47           *((volatile unsigned int*)(0x42C80E3CUL))
#define bFM3_ETHERNET_MAC0_MAR6H_MBC0          *((volatile unsigned int*)(0x42C80E60UL))
#define bFM3_ETHERNET_MAC0_MAR6H_MBC1          *((volatile unsigned int*)(0x42C80E64UL))
#define bFM3_ETHERNET_MAC0_MAR6H_MBC2          *((volatile unsigned int*)(0x42C80E68UL))
#define bFM3_ETHERNET_MAC0_MAR6H_MBC3          *((volatile unsigned int*)(0x42C80E6CUL))
#define bFM3_ETHERNET_MAC0_MAR6H_MBC4          *((volatile unsigned int*)(0x42C80E70UL))
#define bFM3_ETHERNET_MAC0_MAR6H_MBC5          *((volatile unsigned int*)(0x42C80E74UL))
#define bFM3_ETHERNET_MAC0_MAR6H_SA            *((volatile unsigned int*)(0x42C80E78UL))
#define bFM3_ETHERNET_MAC0_MAR6H_AE            *((volatile unsigned int*)(0x42C80E7CUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A0            *((volatile unsigned int*)(0x42C80E80UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A1            *((volatile unsigned int*)(0x42C80E84UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A2            *((volatile unsigned int*)(0x42C80E88UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A3            *((volatile unsigned int*)(0x42C80E8CUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A4            *((volatile unsigned int*)(0x42C80E90UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A5            *((volatile unsigned int*)(0x42C80E94UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A6            *((volatile unsigned int*)(0x42C80E98UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A7            *((volatile unsigned int*)(0x42C80E9CUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A8            *((volatile unsigned int*)(0x42C80EA0UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A9            *((volatile unsigned int*)(0x42C80EA4UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A10           *((volatile unsigned int*)(0x42C80EA8UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A11           *((volatile unsigned int*)(0x42C80EACUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A12           *((volatile unsigned int*)(0x42C80EB0UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A13           *((volatile unsigned int*)(0x42C80EB4UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A14           *((volatile unsigned int*)(0x42C80EB8UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A15           *((volatile unsigned int*)(0x42C80EBCUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A16           *((volatile unsigned int*)(0x42C80EC0UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A17           *((volatile unsigned int*)(0x42C80EC4UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A18           *((volatile unsigned int*)(0x42C80EC8UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A19           *((volatile unsigned int*)(0x42C80ECCUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A20           *((volatile unsigned int*)(0x42C80ED0UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A21           *((volatile unsigned int*)(0x42C80ED4UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A22           *((volatile unsigned int*)(0x42C80ED8UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A23           *((volatile unsigned int*)(0x42C80EDCUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A24           *((volatile unsigned int*)(0x42C80EE0UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A25           *((volatile unsigned int*)(0x42C80EE4UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A26           *((volatile unsigned int*)(0x42C80EE8UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A27           *((volatile unsigned int*)(0x42C80EECUL))
#define bFM3_ETHERNET_MAC0_MAR6L_A28           *((volatile unsigned int*)(0x42C80EF0UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A29           *((volatile unsigned int*)(0x42C80EF4UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A30           *((volatile unsigned int*)(0x42C80EF8UL))
#define bFM3_ETHERNET_MAC0_MAR6L_A31           *((volatile unsigned int*)(0x42C80EFCUL))
#define bFM3_ETHERNET_MAC0_MAR7H_A32           *((volatile unsigned int*)(0x42C80F00UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A33           *((volatile unsigned int*)(0x42C80F04UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A34           *((volatile unsigned int*)(0x42C80F08UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A35           *((volatile unsigned int*)(0x42C80F0CUL))
#define bFM3_ETHERNET_MAC0_MAR7H_A36           *((volatile unsigned int*)(0x42C80F10UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A37           *((volatile unsigned int*)(0x42C80F14UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A38           *((volatile unsigned int*)(0x42C80F18UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A39           *((volatile unsigned int*)(0x42C80F1CUL))
#define bFM3_ETHERNET_MAC0_MAR7H_A40           *((volatile unsigned int*)(0x42C80F20UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A41           *((volatile unsigned int*)(0x42C80F24UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A42           *((volatile unsigned int*)(0x42C80F28UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A43           *((volatile unsigned int*)(0x42C80F2CUL))
#define bFM3_ETHERNET_MAC0_MAR7H_A44           *((volatile unsigned int*)(0x42C80F30UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A45           *((volatile unsigned int*)(0x42C80F34UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A46           *((volatile unsigned int*)(0x42C80F38UL))
#define bFM3_ETHERNET_MAC0_MAR7H_A47           *((volatile unsigned int*)(0x42C80F3CUL))
#define bFM3_ETHERNET_MAC0_MAR7H_MBC0          *((volatile unsigned int*)(0x42C80F60UL))
#define bFM3_ETHERNET_MAC0_MAR7H_MBC1          *((volatile unsigned int*)(0x42C80F64UL))
#define bFM3_ETHERNET_MAC0_MAR7H_MBC2          *((volatile unsigned int*)(0x42C80F68UL))
#define bFM3_ETHERNET_MAC0_MAR7H_MBC3          *((volatile unsigned int*)(0x42C80F6CUL))
#define bFM3_ETHERNET_MAC0_MAR7H_MBC4          *((volatile unsigned int*)(0x42C80F70UL))
#define bFM3_ETHERNET_MAC0_MAR7H_MBC5          *((volatile unsigned int*)(0x42C80F74UL))
#define bFM3_ETHERNET_MAC0_MAR7H_SA            *((volatile unsigned int*)(0x42C80F78UL))
#define bFM3_ETHERNET_MAC0_MAR7H_AE            *((volatile unsigned int*)(0x42C80F7CUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A0            *((volatile unsigned int*)(0x42C80F80UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A1            *((volatile unsigned int*)(0x42C80F84UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A2            *((volatile unsigned int*)(0x42C80F88UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A3            *((volatile unsigned int*)(0x42C80F8CUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A4            *((volatile unsigned int*)(0x42C80F90UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A5            *((volatile unsigned int*)(0x42C80F94UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A6            *((volatile unsigned int*)(0x42C80F98UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A7            *((volatile unsigned int*)(0x42C80F9CUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A8            *((volatile unsigned int*)(0x42C80FA0UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A9            *((volatile unsigned int*)(0x42C80FA4UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A10           *((volatile unsigned int*)(0x42C80FA8UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A11           *((volatile unsigned int*)(0x42C80FACUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A12           *((volatile unsigned int*)(0x42C80FB0UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A13           *((volatile unsigned int*)(0x42C80FB4UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A14           *((volatile unsigned int*)(0x42C80FB8UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A15           *((volatile unsigned int*)(0x42C80FBCUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A16           *((volatile unsigned int*)(0x42C80FC0UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A17           *((volatile unsigned int*)(0x42C80FC4UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A18           *((volatile unsigned int*)(0x42C80FC8UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A19           *((volatile unsigned int*)(0x42C80FCCUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A20           *((volatile unsigned int*)(0x42C80FD0UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A21           *((volatile unsigned int*)(0x42C80FD4UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A22           *((volatile unsigned int*)(0x42C80FD8UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A23           *((volatile unsigned int*)(0x42C80FDCUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A24           *((volatile unsigned int*)(0x42C80FE0UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A25           *((volatile unsigned int*)(0x42C80FE4UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A26           *((volatile unsigned int*)(0x42C80FE8UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A27           *((volatile unsigned int*)(0x42C80FECUL))
#define bFM3_ETHERNET_MAC0_MAR7L_A28           *((volatile unsigned int*)(0x42C80FF0UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A29           *((volatile unsigned int*)(0x42C80FF4UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A30           *((volatile unsigned int*)(0x42C80FF8UL))
#define bFM3_ETHERNET_MAC0_MAR7L_A31           *((volatile unsigned int*)(0x42C80FFCUL))
#define bFM3_ETHERNET_MAC0_MAR8H_A32           *((volatile unsigned int*)(0x42C81000UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A33           *((volatile unsigned int*)(0x42C81004UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A34           *((volatile unsigned int*)(0x42C81008UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A35           *((volatile unsigned int*)(0x42C8100CUL))
#define bFM3_ETHERNET_MAC0_MAR8H_A36           *((volatile unsigned int*)(0x42C81010UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A37           *((volatile unsigned int*)(0x42C81014UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A38           *((volatile unsigned int*)(0x42C81018UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A39           *((volatile unsigned int*)(0x42C8101CUL))
#define bFM3_ETHERNET_MAC0_MAR8H_A40           *((volatile unsigned int*)(0x42C81020UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A41           *((volatile unsigned int*)(0x42C81024UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A42           *((volatile unsigned int*)(0x42C81028UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A43           *((volatile unsigned int*)(0x42C8102CUL))
#define bFM3_ETHERNET_MAC0_MAR8H_A44           *((volatile unsigned int*)(0x42C81030UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A45           *((volatile unsigned int*)(0x42C81034UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A46           *((volatile unsigned int*)(0x42C81038UL))
#define bFM3_ETHERNET_MAC0_MAR8H_A47           *((volatile unsigned int*)(0x42C8103CUL))
#define bFM3_ETHERNET_MAC0_MAR8H_MBC0          *((volatile unsigned int*)(0x42C81060UL))
#define bFM3_ETHERNET_MAC0_MAR8H_MBC1          *((volatile unsigned int*)(0x42C81064UL))
#define bFM3_ETHERNET_MAC0_MAR8H_MBC2          *((volatile unsigned int*)(0x42C81068UL))
#define bFM3_ETHERNET_MAC0_MAR8H_MBC3          *((volatile unsigned int*)(0x42C8106CUL))
#define bFM3_ETHERNET_MAC0_MAR8H_MBC4          *((volatile unsigned int*)(0x42C81070UL))
#define bFM3_ETHERNET_MAC0_MAR8H_MBC5          *((volatile unsigned int*)(0x42C81074UL))
#define bFM3_ETHERNET_MAC0_MAR8H_SA            *((volatile unsigned int*)(0x42C81078UL))
#define bFM3_ETHERNET_MAC0_MAR8H_AE            *((volatile unsigned int*)(0x42C8107CUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A0            *((volatile unsigned int*)(0x42C81080UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A1            *((volatile unsigned int*)(0x42C81084UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A2            *((volatile unsigned int*)(0x42C81088UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A3            *((volatile unsigned int*)(0x42C8108CUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A4            *((volatile unsigned int*)(0x42C81090UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A5            *((volatile unsigned int*)(0x42C81094UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A6            *((volatile unsigned int*)(0x42C81098UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A7            *((volatile unsigned int*)(0x42C8109CUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A8            *((volatile unsigned int*)(0x42C810A0UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A9            *((volatile unsigned int*)(0x42C810A4UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A10           *((volatile unsigned int*)(0x42C810A8UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A11           *((volatile unsigned int*)(0x42C810ACUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A12           *((volatile unsigned int*)(0x42C810B0UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A13           *((volatile unsigned int*)(0x42C810B4UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A14           *((volatile unsigned int*)(0x42C810B8UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A15           *((volatile unsigned int*)(0x42C810BCUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A16           *((volatile unsigned int*)(0x42C810C0UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A17           *((volatile unsigned int*)(0x42C810C4UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A18           *((volatile unsigned int*)(0x42C810C8UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A19           *((volatile unsigned int*)(0x42C810CCUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A20           *((volatile unsigned int*)(0x42C810D0UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A21           *((volatile unsigned int*)(0x42C810D4UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A22           *((volatile unsigned int*)(0x42C810D8UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A23           *((volatile unsigned int*)(0x42C810DCUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A24           *((volatile unsigned int*)(0x42C810E0UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A25           *((volatile unsigned int*)(0x42C810E4UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A26           *((volatile unsigned int*)(0x42C810E8UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A27           *((volatile unsigned int*)(0x42C810ECUL))
#define bFM3_ETHERNET_MAC0_MAR8L_A28           *((volatile unsigned int*)(0x42C810F0UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A29           *((volatile unsigned int*)(0x42C810F4UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A30           *((volatile unsigned int*)(0x42C810F8UL))
#define bFM3_ETHERNET_MAC0_MAR8L_A31           *((volatile unsigned int*)(0x42C810FCUL))
#define bFM3_ETHERNET_MAC0_MAR9H_A32           *((volatile unsigned int*)(0x42C81100UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A33           *((volatile unsigned int*)(0x42C81104UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A34           *((volatile unsigned int*)(0x42C81108UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A35           *((volatile unsigned int*)(0x42C8110CUL))
#define bFM3_ETHERNET_MAC0_MAR9H_A36           *((volatile unsigned int*)(0x42C81110UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A37           *((volatile unsigned int*)(0x42C81114UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A38           *((volatile unsigned int*)(0x42C81118UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A39           *((volatile unsigned int*)(0x42C8111CUL))
#define bFM3_ETHERNET_MAC0_MAR9H_A40           *((volatile unsigned int*)(0x42C81120UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A41           *((volatile unsigned int*)(0x42C81124UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A42           *((volatile unsigned int*)(0x42C81128UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A43           *((volatile unsigned int*)(0x42C8112CUL))
#define bFM3_ETHERNET_MAC0_MAR9H_A44           *((volatile unsigned int*)(0x42C81130UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A45           *((volatile unsigned int*)(0x42C81134UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A46           *((volatile unsigned int*)(0x42C81138UL))
#define bFM3_ETHERNET_MAC0_MAR9H_A47           *((volatile unsigned int*)(0x42C8113CUL))
#define bFM3_ETHERNET_MAC0_MAR9H_MBC0          *((volatile unsigned int*)(0x42C81160UL))
#define bFM3_ETHERNET_MAC0_MAR9H_MBC1          *((volatile unsigned int*)(0x42C81164UL))
#define bFM3_ETHERNET_MAC0_MAR9H_MBC2          *((volatile unsigned int*)(0x42C81168UL))
#define bFM3_ETHERNET_MAC0_MAR9H_MBC3          *((volatile unsigned int*)(0x42C8116CUL))
#define bFM3_ETHERNET_MAC0_MAR9H_MBC4          *((volatile unsigned int*)(0x42C81170UL))
#define bFM3_ETHERNET_MAC0_MAR9H_MBC5          *((volatile unsigned int*)(0x42C81174UL))
#define bFM3_ETHERNET_MAC0_MAR9H_SA            *((volatile unsigned int*)(0x42C81178UL))
#define bFM3_ETHERNET_MAC0_MAR9H_AE            *((volatile unsigned int*)(0x42C8117CUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A0            *((volatile unsigned int*)(0x42C81180UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A1            *((volatile unsigned int*)(0x42C81184UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A2            *((volatile unsigned int*)(0x42C81188UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A3            *((volatile unsigned int*)(0x42C8118CUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A4            *((volatile unsigned int*)(0x42C81190UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A5            *((volatile unsigned int*)(0x42C81194UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A6            *((volatile unsigned int*)(0x42C81198UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A7            *((volatile unsigned int*)(0x42C8119CUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A8            *((volatile unsigned int*)(0x42C811A0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A9            *((volatile unsigned int*)(0x42C811A4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A10           *((volatile unsigned int*)(0x42C811A8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A11           *((volatile unsigned int*)(0x42C811ACUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A12           *((volatile unsigned int*)(0x42C811B0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A13           *((volatile unsigned int*)(0x42C811B4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A14           *((volatile unsigned int*)(0x42C811B8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A15           *((volatile unsigned int*)(0x42C811BCUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A16           *((volatile unsigned int*)(0x42C811C0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A17           *((volatile unsigned int*)(0x42C811C4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A18           *((volatile unsigned int*)(0x42C811C8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A19           *((volatile unsigned int*)(0x42C811CCUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A20           *((volatile unsigned int*)(0x42C811D0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A21           *((volatile unsigned int*)(0x42C811D4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A22           *((volatile unsigned int*)(0x42C811D8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A23           *((volatile unsigned int*)(0x42C811DCUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A24           *((volatile unsigned int*)(0x42C811E0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A25           *((volatile unsigned int*)(0x42C811E4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A26           *((volatile unsigned int*)(0x42C811E8UL))
