AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
#define bFM3_ETHERNET_MAC0_MAR14L_A16          *((volatile unsigned int*)(0x42C816C0UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A17          *((volatile unsigned int*)(0x42C816C4UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A18          *((volatile unsigned int*)(0x42C816C8UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A19          *((volatile unsigned int*)(0x42C816CCUL))
#define bFM3_ETHERNET_MAC0_MAR14L_A20          *((volatile unsigned int*)(0x42C816D0UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A21          *((volatile unsigned int*)(0x42C816D4UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A22          *((volatile unsigned int*)(0x42C816D8UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A23          *((volatile unsigned int*)(0x42C816DCUL))
#define bFM3_ETHERNET_MAC0_MAR14L_A24          *((volatile unsigned int*)(0x42C816E0UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A25          *((volatile unsigned int*)(0x42C816E4UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A26          *((volatile unsigned int*)(0x42C816E8UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A27          *((volatile unsigned int*)(0x42C816ECUL))
#define bFM3_ETHERNET_MAC0_MAR14L_A28          *((volatile unsigned int*)(0x42C816F0UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A29          *((volatile unsigned int*)(0x42C816F4UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A30          *((volatile unsigned int*)(0x42C816F8UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A31          *((volatile unsigned int*)(0x42C816FCUL))
#define bFM3_ETHERNET_MAC0_MAR15H_A32          *((volatile unsigned int*)(0x42C81700UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A33          *((volatile unsigned int*)(0x42C81704UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A34          *((volatile unsigned int*)(0x42C81708UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A35          *((volatile unsigned int*)(0x42C8170CUL))
#define bFM3_ETHERNET_MAC0_MAR15H_A36          *((volatile unsigned int*)(0x42C81710UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A37          *((volatile unsigned int*)(0x42C81714UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A38          *((volatile unsigned int*)(0x42C81718UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A39          *((volatile unsigned int*)(0x42C8171CUL))
#define bFM3_ETHERNET_MAC0_MAR15H_A40          *((volatile unsigned int*)(0x42C81720UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A41          *((volatile unsigned int*)(0x42C81724UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A42          *((volatile unsigned int*)(0x42C81728UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A43          *((volatile unsigned int*)(0x42C8172CUL))
#define bFM3_ETHERNET_MAC0_MAR15H_A44          *((volatile unsigned int*)(0x42C81730UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A45          *((volatile unsigned int*)(0x42C81734UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A46          *((volatile unsigned int*)(0x42C81738UL))
#define bFM3_ETHERNET_MAC0_MAR15H_A47          *((volatile unsigned int*)(0x42C8173CUL))
#define bFM3_ETHERNET_MAC0_MAR15H_MBC0         *((volatile unsigned int*)(0x42C81760UL))
#define bFM3_ETHERNET_MAC0_MAR15H_MBC1         *((volatile unsigned int*)(0x42C81764UL))
#define bFM3_ETHERNET_MAC0_MAR15H_MBC2         *((volatile unsigned int*)(0x42C81768UL))
#define bFM3_ETHERNET_MAC0_MAR15H_MBC3         *((volatile unsigned int*)(0x42C8176CUL))
#define bFM3_ETHERNET_MAC0_MAR15H_MBC4         *((volatile unsigned int*)(0x42C81770UL))
#define bFM3_ETHERNET_MAC0_MAR15H_MBC5         *((volatile unsigned int*)(0x42C81774UL))
#define bFM3_ETHERNET_MAC0_MAR15H_SA           *((volatile unsigned int*)(0x42C81778UL))
#define bFM3_ETHERNET_MAC0_MAR15H_AE           *((volatile unsigned int*)(0x42C8177CUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A0           *((volatile unsigned int*)(0x42C81780UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A1           *((volatile unsigned int*)(0x42C81784UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A2           *((volatile unsigned int*)(0x42C81788UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A3           *((volatile unsigned int*)(0x42C8178CUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A4           *((volatile unsigned int*)(0x42C81790UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A5           *((volatile unsigned int*)(0x42C81794UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A6           *((volatile unsigned int*)(0x42C81798UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A7           *((volatile unsigned int*)(0x42C8179CUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A8           *((volatile unsigned int*)(0x42C817A0UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A9           *((volatile unsigned int*)(0x42C817A4UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A10          *((volatile unsigned int*)(0x42C817A8UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A11          *((volatile unsigned int*)(0x42C817ACUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A12          *((volatile unsigned int*)(0x42C817B0UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A13          *((volatile unsigned int*)(0x42C817B4UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A14          *((volatile unsigned int*)(0x42C817B8UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A15          *((volatile unsigned int*)(0x42C817BCUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A16          *((volatile unsigned int*)(0x42C817C0UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A17          *((volatile unsigned int*)(0x42C817C4UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A18          *((volatile unsigned int*)(0x42C817C8UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A19          *((volatile unsigned int*)(0x42C817CCUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A20          *((volatile unsigned int*)(0x42C817D0UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A21          *((volatile unsigned int*)(0x42C817D4UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A22          *((volatile unsigned int*)(0x42C817D8UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A23          *((volatile unsigned int*)(0x42C817DCUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A24          *((volatile unsigned int*)(0x42C817E0UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A25          *((volatile unsigned int*)(0x42C817E4UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A26          *((volatile unsigned int*)(0x42C817E8UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A27          *((volatile unsigned int*)(0x42C817ECUL))
#define bFM3_ETHERNET_MAC0_MAR15L_A28          *((volatile unsigned int*)(0x42C817F0UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A29          *((volatile unsigned int*)(0x42C817F4UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A30          *((volatile unsigned int*)(0x42C817F8UL))
#define bFM3_ETHERNET_MAC0_MAR15L_A31          *((volatile unsigned int*)(0x42C817FCUL))
#define bFM3_ETHERNET_MAC0_RGSR_LM             *((volatile unsigned int*)(0x42C81B00UL))
#define bFM3_ETHERNET_MAC0_RGSR_LSP0           *((volatile unsigned int*)(0x42C81B04UL))
#define bFM3_ETHERNET_MAC0_RGSR_LSP1           *((volatile unsigned int*)(0x42C81B08UL))
#define bFM3_ETHERNET_MAC0_RGSR_LS             *((volatile unsigned int*)(0x42C81B0CUL))
#define bFM3_ETHERNET_MAC0_TSCR_TSE            *((volatile unsigned int*)(0x42C8E000UL))
#define bFM3_ETHERNET_MAC0_TSCR_TFCU           *((volatile unsigned int*)(0x42C8E004UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSI            *((volatile unsigned int*)(0x42C8E008UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSU            *((volatile unsigned int*)(0x42C8E00CUL))
#define bFM3_ETHERNET_MAC0_TSCR_TITE           *((volatile unsigned int*)(0x42C8E010UL))
#define bFM3_ETHERNET_MAC0_TSCR_TARU           *((volatile unsigned int*)(0x42C8E014UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSEA           *((volatile unsigned int*)(0x42C8E020UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSDB           *((volatile unsigned int*)(0x42C8E024UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSV2E          *((volatile unsigned int*)(0x42C8E028UL))
#define bFM3_ETHERNET_MAC0_TSCR_TETSP          *((volatile unsigned int*)(0x42C8E02CUL))
#define bFM3_ETHERNET_MAC0_TSCR_TSIP6E         *((volatile unsigned int*)(0x42C8E030UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSIP4E         *((volatile unsigned int*)(0x42C8E034UL))
#define bFM3_ETHERNET_MAC0_TSCR_TETSEM         *((volatile unsigned int*)(0x42C8E038UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSMRM          *((volatile unsigned int*)(0x42C8E03CUL))
#define bFM3_ETHERNET_MAC0_TSCR_TSPS0          *((volatile unsigned int*)(0x42C8E040UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSPS1          *((volatile unsigned int*)(0x42C8E044UL))
#define bFM3_ETHERNET_MAC0_TSCR_TSENMF         *((volatile unsigned int*)(0x42C8E048UL))
#define bFM3_ETHERNET_MAC0_TSCR_ATSFC          *((volatile unsigned int*)(0x42C8E060UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC0         *((volatile unsigned int*)(0x42C8E080UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC1         *((volatile unsigned int*)(0x42C8E084UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC2         *((volatile unsigned int*)(0x42C8E088UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC3         *((volatile unsigned int*)(0x42C8E08CUL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC4         *((volatile unsigned int*)(0x42C8E090UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC5         *((volatile unsigned int*)(0x42C8E094UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC6         *((volatile unsigned int*)(0x42C8E098UL))
#define bFM3_ETHERNET_MAC0_SSIR_SSINC7         *((volatile unsigned int*)(0x42C8E09CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS0           *((volatile unsigned int*)(0x42C8E100UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS1           *((volatile unsigned int*)(0x42C8E104UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS2           *((volatile unsigned int*)(0x42C8E108UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS3           *((volatile unsigned int*)(0x42C8E10CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS4           *((volatile unsigned int*)(0x42C8E110UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS5           *((volatile unsigned int*)(0x42C8E114UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS6           *((volatile unsigned int*)(0x42C8E118UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS7           *((volatile unsigned int*)(0x42C8E11CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS8           *((volatile unsigned int*)(0x42C8E120UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS9           *((volatile unsigned int*)(0x42C8E124UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS10          *((volatile unsigned int*)(0x42C8E128UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS11          *((volatile unsigned int*)(0x42C8E12CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS12          *((volatile unsigned int*)(0x42C8E130UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS13          *((volatile unsigned int*)(0x42C8E134UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS14          *((volatile unsigned int*)(0x42C8E138UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS15          *((volatile unsigned int*)(0x42C8E13CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS16          *((volatile unsigned int*)(0x42C8E140UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS17          *((volatile unsigned int*)(0x42C8E144UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS18          *((volatile unsigned int*)(0x42C8E148UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS19          *((volatile unsigned int*)(0x42C8E14CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS20          *((volatile unsigned int*)(0x42C8E150UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS21          *((volatile unsigned int*)(0x42C8E154UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS22          *((volatile unsigned int*)(0x42C8E158UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS23          *((volatile unsigned int*)(0x42C8E15CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS24          *((volatile unsigned int*)(0x42C8E160UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS25          *((volatile unsigned int*)(0x42C8E164UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS26          *((volatile unsigned int*)(0x42C8E168UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS27          *((volatile unsigned int*)(0x42C8E16CUL))
#define bFM3_ETHERNET_MAC0_STSR_TSS28          *((volatile unsigned int*)(0x42C8E170UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS29          *((volatile unsigned int*)(0x42C8E174UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS30          *((volatile unsigned int*)(0x42C8E178UL))
#define bFM3_ETHERNET_MAC0_STSR_TSS31          *((volatile unsigned int*)(0x42C8E17CUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS0          *((volatile unsigned int*)(0x42C8E080UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS1          *((volatile unsigned int*)(0x42C8E084UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS2          *((volatile unsigned int*)(0x42C8E088UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS3          *((volatile unsigned int*)(0x42C8E08CUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS4          *((volatile unsigned int*)(0x42C8E090UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS5          *((volatile unsigned int*)(0x42C8E094UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS6          *((volatile unsigned int*)(0x42C8E098UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS7          *((volatile unsigned int*)(0x42C8E09CUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS8          *((volatile unsigned int*)(0x42C8E0A0UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS9          *((volatile unsigned int*)(0x42C8E0A4UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS10         *((volatile unsigned int*)(0x42C8E0A8UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS11         *((volatile unsigned int*)(0x42C8E0ACUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS12         *((volatile unsigned int*)(0x42C8E0B0UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS13         *((volatile unsigned int*)(0x42C8E0B4UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS14         *((volatile unsigned int*)(0x42C8E0B8UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS15         *((volatile unsigned int*)(0x42C8E0BCUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS16         *((volatile unsigned int*)(0x42C8E0C0UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS17         *((volatile unsigned int*)(0x42C8E0C4UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS18         *((volatile unsigned int*)(0x42C8E0C8UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS19         *((volatile unsigned int*)(0x42C8E0CCUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS20         *((volatile unsigned int*)(0x42C8E0D0UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS21         *((volatile unsigned int*)(0x42C8E0D4UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS22         *((volatile unsigned int*)(0x42C8E0D8UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS23         *((volatile unsigned int*)(0x42C8E0DCUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS24         *((volatile unsigned int*)(0x42C8E0E0UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS25         *((volatile unsigned int*)(0x42C8E0E4UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS26         *((volatile unsigned int*)(0x42C8E0E8UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS27         *((volatile unsigned int*)(0x42C8E0ECUL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS28         *((volatile unsigned int*)(0x42C8E0F0UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS29         *((volatile unsigned int*)(0x42C8E0F4UL))
#define bFM3_ETHERNET_MAC0_STNR_TSSS30         *((volatile unsigned int*)(0x42C8E0F8UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS0          *((volatile unsigned int*)(0x42C8E200UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS1          *((volatile unsigned int*)(0x42C8E204UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS2          *((volatile unsigned int*)(0x42C8E208UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS3          *((volatile unsigned int*)(0x42C8E20CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS4          *((volatile unsigned int*)(0x42C8E210UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS5          *((volatile unsigned int*)(0x42C8E214UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS6          *((volatile unsigned int*)(0x42C8E218UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS7          *((volatile unsigned int*)(0x42C8E21CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS8          *((volatile unsigned int*)(0x42C8E220UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS9          *((volatile unsigned int*)(0x42C8E224UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS10         *((volatile unsigned int*)(0x42C8E228UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS11         *((volatile unsigned int*)(0x42C8E22CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS12         *((volatile unsigned int*)(0x42C8E230UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS13         *((volatile unsigned int*)(0x42C8E234UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS14         *((volatile unsigned int*)(0x42C8E238UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS15         *((volatile unsigned int*)(0x42C8E23CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS16         *((volatile unsigned int*)(0x42C8E240UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS17         *((volatile unsigned int*)(0x42C8E244UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS18         *((volatile unsigned int*)(0x42C8E248UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS19         *((volatile unsigned int*)(0x42C8E24CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS20         *((volatile unsigned int*)(0x42C8E250UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS21         *((volatile unsigned int*)(0x42C8E254UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS22         *((volatile unsigned int*)(0x42C8E258UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS23         *((volatile unsigned int*)(0x42C8E25CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS24         *((volatile unsigned int*)(0x42C8E260UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS25         *((volatile unsigned int*)(0x42C8E264UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS26         *((volatile unsigned int*)(0x42C8E268UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS27         *((volatile unsigned int*)(0x42C8E26CUL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS28         *((volatile unsigned int*)(0x42C8E270UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS29         *((volatile unsigned int*)(0x42C8E274UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS30         *((volatile unsigned int*)(0x42C8E278UL))
#define bFM3_ETHERNET_MAC0_STSUR_TSS31         *((volatile unsigned int*)(0x42C8E27CUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS0         *((volatile unsigned int*)(0x42C8E280UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS1         *((volatile unsigned int*)(0x42C8E284UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS2         *((volatile unsigned int*)(0x42C8E288UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS3         *((volatile unsigned int*)(0x42C8E28CUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS4         *((volatile unsigned int*)(0x42C8E290UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS5         *((volatile unsigned int*)(0x42C8E294UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS6         *((volatile unsigned int*)(0x42C8E298UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS7         *((volatile unsigned int*)(0x42C8E29CUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS8         *((volatile unsigned int*)(0x42C8E2A0UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS9         *((volatile unsigned int*)(0x42C8E2A4UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS10        *((volatile unsigned int*)(0x42C8E2A8UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS11        *((volatile unsigned int*)(0x42C8E2ACUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS12        *((volatile unsigned int*)(0x42C8E2B0UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS13        *((volatile unsigned int*)(0x42C8E2B4UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS14        *((volatile unsigned int*)(0x42C8E2B8UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS15        *((volatile unsigned int*)(0x42C8E2BCUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS16        *((volatile unsigned int*)(0x42C8E2C0UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS17        *((volatile unsigned int*)(0x42C8E2C4UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS18        *((volatile unsigned int*)(0x42C8E2C8UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS19        *((volatile unsigned int*)(0x42C8E2CCUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS20        *((volatile unsigned int*)(0x42C8E2D0UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS21        *((volatile unsigned int*)(0x42C8E2D4UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS22        *((volatile unsigned int*)(0x42C8E2D8UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS23        *((volatile unsigned int*)(0x42C8E2DCUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS24        *((volatile unsigned int*)(0x42C8E2E0UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS25        *((volatile unsigned int*)(0x42C8E2E4UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS26        *((volatile unsigned int*)(0x42C8E2E8UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS27        *((volatile unsigned int*)(0x42C8E2ECUL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS28        *((volatile unsigned int*)(0x42C8E2F0UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS29        *((volatile unsigned int*)(0x42C8E2F4UL))
#define bFM3_ETHERNET_MAC0_STNUR_TSSS30        *((volatile unsigned int*)(0x42C8E2F8UL))
#define bFM3_ETHERNET_MAC0_STNUR_ADDSUB        *((volatile unsigned int*)(0x42C8E2FCUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR0          *((volatile unsigned int*)(0x42C8E300UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR1          *((volatile unsigned int*)(0x42C8E304UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR2          *((volatile unsigned int*)(0x42C8E308UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR3          *((volatile unsigned int*)(0x42C8E30CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR4          *((volatile unsigned int*)(0x42C8E310UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR5          *((volatile unsigned int*)(0x42C8E314UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR6          *((volatile unsigned int*)(0x42C8E318UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR7          *((volatile unsigned int*)(0x42C8E31CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR8          *((volatile unsigned int*)(0x42C8E320UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR9          *((volatile unsigned int*)(0x42C8E324UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR10         *((volatile unsigned int*)(0x42C8E328UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR11         *((volatile unsigned int*)(0x42C8E32CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR12         *((volatile unsigned int*)(0x42C8E330UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR13         *((volatile unsigned int*)(0x42C8E334UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR14         *((volatile unsigned int*)(0x42C8E338UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR15         *((volatile unsigned int*)(0x42C8E33CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR16         *((volatile unsigned int*)(0x42C8E340UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR17         *((volatile unsigned int*)(0x42C8E344UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR18         *((volatile unsigned int*)(0x42C8E348UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR19         *((volatile unsigned int*)(0x42C8E34CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR20         *((volatile unsigned int*)(0x42C8E350UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR21         *((volatile unsigned int*)(0x42C8E354UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR22         *((volatile unsigned int*)(0x42C8E358UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR23         *((volatile unsigned int*)(0x42C8E35CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR24         *((volatile unsigned int*)(0x42C8E360UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR25         *((volatile unsigned int*)(0x42C8E364UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR26         *((volatile unsigned int*)(0x42C8E368UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR27         *((volatile unsigned int*)(0x42C8E36CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR28         *((volatile unsigned int*)(0x42C8E370UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR29         *((volatile unsigned int*)(0x42C8E374UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR30         *((volatile unsigned int*)(0x42C8E378UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR31         *((volatile unsigned int*)(0x42C8E37CUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR0          *((volatile unsigned int*)(0x42C8E380UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR1          *((volatile unsigned int*)(0x42C8E384UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR2          *((volatile unsigned int*)(0x42C8E388UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR3          *((volatile unsigned int*)(0x42C8E38CUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR4          *((volatile unsigned int*)(0x42C8E390UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR5          *((volatile unsigned int*)(0x42C8E394UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR6          *((volatile unsigned int*)(0x42C8E398UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR7          *((volatile unsigned int*)(0x42C8E39CUL))
