AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
#define bFM3_ETHERNET_MAC0_MAR27L_A21          *((volatile unsigned int*)(0x42C90BD4UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A22          *((volatile unsigned int*)(0x42C90BD8UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A23          *((volatile unsigned int*)(0x42C90BDCUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A24          *((volatile unsigned int*)(0x42C90BE0UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A25          *((volatile unsigned int*)(0x42C90BE4UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A26          *((volatile unsigned int*)(0x42C90BE8UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A27          *((volatile unsigned int*)(0x42C90BECUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A28          *((volatile unsigned int*)(0x42C90BF0UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A29          *((volatile unsigned int*)(0x42C90BF4UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A30          *((volatile unsigned int*)(0x42C90BF8UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A31          *((volatile unsigned int*)(0x42C90BFCUL))
#define bFM3_ETHERNET_MAC0_MAR28H_A32          *((volatile unsigned int*)(0x42C90C00UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A33          *((volatile unsigned int*)(0x42C90C04UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A34          *((volatile unsigned int*)(0x42C90C08UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A35          *((volatile unsigned int*)(0x42C90C0CUL))
#define bFM3_ETHERNET_MAC0_MAR28H_A36          *((volatile unsigned int*)(0x42C90C10UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A37          *((volatile unsigned int*)(0x42C90C14UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A38          *((volatile unsigned int*)(0x42C90C18UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A39          *((volatile unsigned int*)(0x42C90C1CUL))
#define bFM3_ETHERNET_MAC0_MAR28H_A40          *((volatile unsigned int*)(0x42C90C20UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A41          *((volatile unsigned int*)(0x42C90C24UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A42          *((volatile unsigned int*)(0x42C90C28UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A43          *((volatile unsigned int*)(0x42C90C2CUL))
#define bFM3_ETHERNET_MAC0_MAR28H_A44          *((volatile unsigned int*)(0x42C90C30UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A45          *((volatile unsigned int*)(0x42C90C34UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A46          *((volatile unsigned int*)(0x42C90C38UL))
#define bFM3_ETHERNET_MAC0_MAR28H_A47          *((volatile unsigned int*)(0x42C90C3CUL))
#define bFM3_ETHERNET_MAC0_MAR28H_MBC0         *((volatile unsigned int*)(0x42C90C60UL))
#define bFM3_ETHERNET_MAC0_MAR28H_MBC1         *((volatile unsigned int*)(0x42C90C64UL))
#define bFM3_ETHERNET_MAC0_MAR28H_MBC2         *((volatile unsigned int*)(0x42C90C68UL))
#define bFM3_ETHERNET_MAC0_MAR28H_MBC3         *((volatile unsigned int*)(0x42C90C6CUL))
#define bFM3_ETHERNET_MAC0_MAR28H_MBC4         *((volatile unsigned int*)(0x42C90C70UL))
#define bFM3_ETHERNET_MAC0_MAR28H_MBC5         *((volatile unsigned int*)(0x42C90C74UL))
#define bFM3_ETHERNET_MAC0_MAR28H_SA           *((volatile unsigned int*)(0x42C90C78UL))
#define bFM3_ETHERNET_MAC0_MAR28H_AE           *((volatile unsigned int*)(0x42C90C7CUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A0           *((volatile unsigned int*)(0x42C90C80UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A1           *((volatile unsigned int*)(0x42C90C84UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A2           *((volatile unsigned int*)(0x42C90C88UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A3           *((volatile unsigned int*)(0x42C90C8CUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A4           *((volatile unsigned int*)(0x42C90C90UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A5           *((volatile unsigned int*)(0x42C90C94UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A6           *((volatile unsigned int*)(0x42C90C98UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A7           *((volatile unsigned int*)(0x42C90C9CUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A8           *((volatile unsigned int*)(0x42C90CA0UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A9           *((volatile unsigned int*)(0x42C90CA4UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A10          *((volatile unsigned int*)(0x42C90CA8UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A11          *((volatile unsigned int*)(0x42C90CACUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A12          *((volatile unsigned int*)(0x42C90CB0UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A13          *((volatile unsigned int*)(0x42C90CB4UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A14          *((volatile unsigned int*)(0x42C90CB8UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A15          *((volatile unsigned int*)(0x42C90CBCUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A16          *((volatile unsigned int*)(0x42C90CC0UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A17          *((volatile unsigned int*)(0x42C90CC4UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A18          *((volatile unsigned int*)(0x42C90CC8UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A19          *((volatile unsigned int*)(0x42C90CCCUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A20          *((volatile unsigned int*)(0x42C90CD0UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A21          *((volatile unsigned int*)(0x42C90CD4UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A22          *((volatile unsigned int*)(0x42C90CD8UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A23          *((volatile unsigned int*)(0x42C90CDCUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A24          *((volatile unsigned int*)(0x42C90CE0UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A25          *((volatile unsigned int*)(0x42C90CE4UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A26          *((volatile unsigned int*)(0x42C90CE8UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A27          *((volatile unsigned int*)(0x42C90CECUL))
#define bFM3_ETHERNET_MAC0_MAR28L_A28          *((volatile unsigned int*)(0x42C90CF0UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A29          *((volatile unsigned int*)(0x42C90CF4UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A30          *((volatile unsigned int*)(0x42C90CF8UL))
#define bFM3_ETHERNET_MAC0_MAR28L_A31          *((volatile unsigned int*)(0x42C90CFCUL))
#define bFM3_ETHERNET_MAC0_MAR29H_A32          *((volatile unsigned int*)(0x42C90D00UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A33          *((volatile unsigned int*)(0x42C90D04UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A34          *((volatile unsigned int*)(0x42C90D08UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A35          *((volatile unsigned int*)(0x42C90D0CUL))
#define bFM3_ETHERNET_MAC0_MAR29H_A36          *((volatile unsigned int*)(0x42C90D10UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A37          *((volatile unsigned int*)(0x42C90D14UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A38          *((volatile unsigned int*)(0x42C90D18UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A39          *((volatile unsigned int*)(0x42C90D1CUL))
#define bFM3_ETHERNET_MAC0_MAR29H_A40          *((volatile unsigned int*)(0x42C90D20UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A41          *((volatile unsigned int*)(0x42C90D24UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A42          *((volatile unsigned int*)(0x42C90D28UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A43          *((volatile unsigned int*)(0x42C90D2CUL))
#define bFM3_ETHERNET_MAC0_MAR29H_A44          *((volatile unsigned int*)(0x42C90D30UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A45          *((volatile unsigned int*)(0x42C90D34UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A46          *((volatile unsigned int*)(0x42C90D38UL))
#define bFM3_ETHERNET_MAC0_MAR29H_A47          *((volatile unsigned int*)(0x42C90D3CUL))
#define bFM3_ETHERNET_MAC0_MAR29H_MBC0         *((volatile unsigned int*)(0x42C90D60UL))
#define bFM3_ETHERNET_MAC0_MAR29H_MBC1         *((volatile unsigned int*)(0x42C90D64UL))
#define bFM3_ETHERNET_MAC0_MAR29H_MBC2         *((volatile unsigned int*)(0x42C90D68UL))
#define bFM3_ETHERNET_MAC0_MAR29H_MBC3         *((volatile unsigned int*)(0x42C90D6CUL))
#define bFM3_ETHERNET_MAC0_MAR29H_MBC4         *((volatile unsigned int*)(0x42C90D70UL))
#define bFM3_ETHERNET_MAC0_MAR29H_MBC5         *((volatile unsigned int*)(0x42C90D74UL))
#define bFM3_ETHERNET_MAC0_MAR29H_SA           *((volatile unsigned int*)(0x42C90D78UL))
#define bFM3_ETHERNET_MAC0_MAR29H_AE           *((volatile unsigned int*)(0x42C90D7CUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A0           *((volatile unsigned int*)(0x42C90D80UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A1           *((volatile unsigned int*)(0x42C90D84UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A2           *((volatile unsigned int*)(0x42C90D88UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A3           *((volatile unsigned int*)(0x42C90D8CUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A4           *((volatile unsigned int*)(0x42C90D90UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A5           *((volatile unsigned int*)(0x42C90D94UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A6           *((volatile unsigned int*)(0x42C90D98UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A7           *((volatile unsigned int*)(0x42C90D9CUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A8           *((volatile unsigned int*)(0x42C90DA0UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A9           *((volatile unsigned int*)(0x42C90DA4UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A10          *((volatile unsigned int*)(0x42C90DA8UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A11          *((volatile unsigned int*)(0x42C90DACUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A12          *((volatile unsigned int*)(0x42C90DB0UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A13          *((volatile unsigned int*)(0x42C90DB4UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A14          *((volatile unsigned int*)(0x42C90DB8UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A15          *((volatile unsigned int*)(0x42C90DBCUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A16          *((volatile unsigned int*)(0x42C90DC0UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A17          *((volatile unsigned int*)(0x42C90DC4UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A18          *((volatile unsigned int*)(0x42C90DC8UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A19          *((volatile unsigned int*)(0x42C90DCCUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A20          *((volatile unsigned int*)(0x42C90DD0UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A21          *((volatile unsigned int*)(0x42C90DD4UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A22          *((volatile unsigned int*)(0x42C90DD8UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A23          *((volatile unsigned int*)(0x42C90DDCUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A24          *((volatile unsigned int*)(0x42C90DE0UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A25          *((volatile unsigned int*)(0x42C90DE4UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A26          *((volatile unsigned int*)(0x42C90DE8UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A27          *((volatile unsigned int*)(0x42C90DECUL))
#define bFM3_ETHERNET_MAC0_MAR29L_A28          *((volatile unsigned int*)(0x42C90DF0UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A29          *((volatile unsigned int*)(0x42C90DF4UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A30          *((volatile unsigned int*)(0x42C90DF8UL))
#define bFM3_ETHERNET_MAC0_MAR29L_A31          *((volatile unsigned int*)(0x42C90DFCUL))
#define bFM3_ETHERNET_MAC0_MAR30H_A32          *((volatile unsigned int*)(0x42C90E00UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A33          *((volatile unsigned int*)(0x42C90E04UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A34          *((volatile unsigned int*)(0x42C90E08UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A35          *((volatile unsigned int*)(0x42C90E0CUL))
#define bFM3_ETHERNET_MAC0_MAR30H_A36          *((volatile unsigned int*)(0x42C90E10UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A37          *((volatile unsigned int*)(0x42C90E14UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A38          *((volatile unsigned int*)(0x42C90E18UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A39          *((volatile unsigned int*)(0x42C90E1CUL))
#define bFM3_ETHERNET_MAC0_MAR30H_A40          *((volatile unsigned int*)(0x42C90E20UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A41          *((volatile unsigned int*)(0x42C90E24UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A42          *((volatile unsigned int*)(0x42C90E28UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A43          *((volatile unsigned int*)(0x42C90E2CUL))
#define bFM3_ETHERNET_MAC0_MAR30H_A44          *((volatile unsigned int*)(0x42C90E30UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A45          *((volatile unsigned int*)(0x42C90E34UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A46          *((volatile unsigned int*)(0x42C90E38UL))
#define bFM3_ETHERNET_MAC0_MAR30H_A47          *((volatile unsigned int*)(0x42C90E3CUL))
#define bFM3_ETHERNET_MAC0_MAR30H_MBC0         *((volatile unsigned int*)(0x42C90E60UL))
#define bFM3_ETHERNET_MAC0_MAR30H_MBC1         *((volatile unsigned int*)(0x42C90E64UL))
#define bFM3_ETHERNET_MAC0_MAR30H_MBC2         *((volatile unsigned int*)(0x42C90E68UL))
#define bFM3_ETHERNET_MAC0_MAR30H_MBC3         *((volatile unsigned int*)(0x42C90E6CUL))
#define bFM3_ETHERNET_MAC0_MAR30H_MBC4         *((volatile unsigned int*)(0x42C90E70UL))
#define bFM3_ETHERNET_MAC0_MAR30H_MBC5         *((volatile unsigned int*)(0x42C90E74UL))
#define bFM3_ETHERNET_MAC0_MAR30H_SA           *((volatile unsigned int*)(0x42C90E78UL))
#define bFM3_ETHERNET_MAC0_MAR30H_AE           *((volatile unsigned int*)(0x42C90E7CUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A0           *((volatile unsigned int*)(0x42C90E80UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A1           *((volatile unsigned int*)(0x42C90E84UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A2           *((volatile unsigned int*)(0x42C90E88UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A3           *((volatile unsigned int*)(0x42C90E8CUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A4           *((volatile unsigned int*)(0x42C90E90UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A5           *((volatile unsigned int*)(0x42C90E94UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A6           *((volatile unsigned int*)(0x42C90E98UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A7           *((volatile unsigned int*)(0x42C90E9CUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A8           *((volatile unsigned int*)(0x42C90EA0UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A9           *((volatile unsigned int*)(0x42C90EA4UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A10          *((volatile unsigned int*)(0x42C90EA8UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A11          *((volatile unsigned int*)(0x42C90EACUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A12          *((volatile unsigned int*)(0x42C90EB0UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A13          *((volatile unsigned int*)(0x42C90EB4UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A14          *((volatile unsigned int*)(0x42C90EB8UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A15          *((volatile unsigned int*)(0x42C90EBCUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A16          *((volatile unsigned int*)(0x42C90EC0UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A17          *((volatile unsigned int*)(0x42C90EC4UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A18          *((volatile unsigned int*)(0x42C90EC8UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A19          *((volatile unsigned int*)(0x42C90ECCUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A20          *((volatile unsigned int*)(0x42C90ED0UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A21          *((volatile unsigned int*)(0x42C90ED4UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A22          *((volatile unsigned int*)(0x42C90ED8UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A23          *((volatile unsigned int*)(0x42C90EDCUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A24          *((volatile unsigned int*)(0x42C90EE0UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A25          *((volatile unsigned int*)(0x42C90EE4UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A26          *((volatile unsigned int*)(0x42C90EE8UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A27          *((volatile unsigned int*)(0x42C90EECUL))
#define bFM3_ETHERNET_MAC0_MAR30L_A28          *((volatile unsigned int*)(0x42C90EF0UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A29          *((volatile unsigned int*)(0x42C90EF4UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A30          *((volatile unsigned int*)(0x42C90EF8UL))
#define bFM3_ETHERNET_MAC0_MAR30L_A31          *((volatile unsigned int*)(0x42C90EFCUL))
#define bFM3_ETHERNET_MAC0_MAR31H_A32          *((volatile unsigned int*)(0x42C90F00UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A33          *((volatile unsigned int*)(0x42C90F04UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A34          *((volatile unsigned int*)(0x42C90F08UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A35          *((volatile unsigned int*)(0x42C90F0CUL))
#define bFM3_ETHERNET_MAC0_MAR31H_A36          *((volatile unsigned int*)(0x42C90F10UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A37          *((volatile unsigned int*)(0x42C90F14UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A38          *((volatile unsigned int*)(0x42C90F18UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A39          *((volatile unsigned int*)(0x42C90F1CUL))
#define bFM3_ETHERNET_MAC0_MAR31H_A40          *((volatile unsigned int*)(0x42C90F20UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A41          *((volatile unsigned int*)(0x42C90F24UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A42          *((volatile unsigned int*)(0x42C90F28UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A43          *((volatile unsigned int*)(0x42C90F2CUL))
#define bFM3_ETHERNET_MAC0_MAR31H_A44          *((volatile unsigned int*)(0x42C90F30UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A45          *((volatile unsigned int*)(0x42C90F34UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A46          *((volatile unsigned int*)(0x42C90F38UL))
#define bFM3_ETHERNET_MAC0_MAR31H_A47          *((volatile unsigned int*)(0x42C90F3CUL))
#define bFM3_ETHERNET_MAC0_MAR31H_MBC0         *((volatile unsigned int*)(0x42C90F60UL))
#define bFM3_ETHERNET_MAC0_MAR31H_MBC1         *((volatile unsigned int*)(0x42C90F64UL))
#define bFM3_ETHERNET_MAC0_MAR31H_MBC2         *((volatile unsigned int*)(0x42C90F68UL))
#define bFM3_ETHERNET_MAC0_MAR31H_MBC3         *((volatile unsigned int*)(0x42C90F6CUL))
#define bFM3_ETHERNET_MAC0_MAR31H_MBC4         *((volatile unsigned int*)(0x42C90F70UL))
#define bFM3_ETHERNET_MAC0_MAR31H_MBC5         *((volatile unsigned int*)(0x42C90F74UL))
#define bFM3_ETHERNET_MAC0_MAR31H_SA           *((volatile unsigned int*)(0x42C90F78UL))
#define bFM3_ETHERNET_MAC0_MAR31H_AE           *((volatile unsigned int*)(0x42C90F7CUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A0           *((volatile unsigned int*)(0x42C90F80UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A1           *((volatile unsigned int*)(0x42C90F84UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A2           *((volatile unsigned int*)(0x42C90F88UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A3           *((volatile unsigned int*)(0x42C90F8CUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A4           *((volatile unsigned int*)(0x42C90F90UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A5           *((volatile unsigned int*)(0x42C90F94UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A6           *((volatile unsigned int*)(0x42C90F98UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A7           *((volatile unsigned int*)(0x42C90F9CUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A8           *((volatile unsigned int*)(0x42C90FA0UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A9           *((volatile unsigned int*)(0x42C90FA4UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A10          *((volatile unsigned int*)(0x42C90FA8UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A11          *((volatile unsigned int*)(0x42C90FACUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A12          *((volatile unsigned int*)(0x42C90FB0UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A13          *((volatile unsigned int*)(0x42C90FB4UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A14          *((volatile unsigned int*)(0x42C90FB8UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A15          *((volatile unsigned int*)(0x42C90FBCUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A16          *((volatile unsigned int*)(0x42C90FC0UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A17          *((volatile unsigned int*)(0x42C90FC4UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A18          *((volatile unsigned int*)(0x42C90FC8UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A19          *((volatile unsigned int*)(0x42C90FCCUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A20          *((volatile unsigned int*)(0x42C90FD0UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A21          *((volatile unsigned int*)(0x42C90FD4UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A22          *((volatile unsigned int*)(0x42C90FD8UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A23          *((volatile unsigned int*)(0x42C90FDCUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A24          *((volatile unsigned int*)(0x42C90FE0UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A25          *((volatile unsigned int*)(0x42C90FE4UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A26          *((volatile unsigned int*)(0x42C90FE8UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A27          *((volatile unsigned int*)(0x42C90FECUL))
#define bFM3_ETHERNET_MAC0_MAR31L_A28          *((volatile unsigned int*)(0x42C90FF0UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A29          *((volatile unsigned int*)(0x42C90FF4UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A30          *((volatile unsigned int*)(0x42C90FF8UL))
#define bFM3_ETHERNET_MAC0_MAR31L_A31          *((volatile unsigned int*)(0x42C90FFCUL))
#define bFM3_ETHERNET_MAC0_BMR_SWR             *((volatile unsigned int*)(0x42CA0000UL))
#define bFM3_ETHERNET_MAC0_BMR_DA              *((volatile unsigned int*)(0x42CA0004UL))
#define bFM3_ETHERNET_MAC0_BMR_DSL0            *((volatile unsigned int*)(0x42CA0008UL))
#define bFM3_ETHERNET_MAC0_BMR_DSL1            *((volatile unsigned int*)(0x42CA000CUL))
#define bFM3_ETHERNET_MAC0_BMR_DSL2            *((volatile unsigned int*)(0x42CA0010UL))
#define bFM3_ETHERNET_MAC0_BMR_DSL3            *((volatile unsigned int*)(0x42CA0014UL))
#define bFM3_ETHERNET_MAC0_BMR_DSL4            *((volatile unsigned int*)(0x42CA0018UL))
#define bFM3_ETHERNET_MAC0_BMR_ATDS            *((volatile unsigned int*)(0x42CA001CUL))
#define bFM3_ETHERNET_MAC0_BMR_PBL0            *((volatile unsigned int*)(0x42CA0020UL))
#define bFM3_ETHERNET_MAC0_BMR_PBL1            *((volatile unsigned int*)(0x42CA0024UL))
#define bFM3_ETHERNET_MAC0_BMR_PBL2            *((volatile unsigned int*)(0x42CA0028UL))
#define bFM3_ETHERNET_MAC0_BMR_PBL3            *((volatile unsigned int*)(0x42CA002CUL))
#define bFM3_ETHERNET_MAC0_BMR_PBL4            *((volatile unsigned int*)(0x42CA0030UL))
#define bFM3_ETHERNET_MAC0_BMR_PBL5            *((volatile unsigned int*)(0x42CA0034UL))
#define bFM3_ETHERNET_MAC0_BMR_PR0             *((volatile unsigned int*)(0x42CA0038UL))
#define bFM3_ETHERNET_MAC0_BMR_PR1             *((volatile unsigned int*)(0x42CA003CUL))
#define bFM3_ETHERNET_MAC0_BMR_FB              *((volatile unsigned int*)(0x42CA0040UL))
#define bFM3_ETHERNET_MAC0_BMR_RPBL0           *((volatile unsigned int*)(0x42CA0044UL))
#define bFM3_ETHERNET_MAC0_BMR_RPBL1           *((volatile unsigned int*)(0x42CA0048UL))
#define bFM3_ETHERNET_MAC0_BMR_RPBL2           *((volatile unsigned int*)(0x42CA004CUL))
#define bFM3_ETHERNET_MAC0_BMR_RPBL3           *((volatile unsigned int*)(0x42CA0050UL))
#define bFM3_ETHERNET_MAC0_BMR_RPBL4           *((volatile unsigned int*)(0x42CA0054UL))
#define bFM3_ETHERNET_MAC0_BMR_RPBL5           *((volatile unsigned int*)(0x42CA0058UL))
#define bFM3_ETHERNET_MAC0_BMR_USP             *((volatile unsigned int*)(0x42CA005CUL))
#define bFM3_ETHERNET_MAC0_BMR_8XPBL           *((volatile unsigned int*)(0x42CA0060UL))
#define bFM3_ETHERNET_MAC0_BMR_AAL             *((volatile unsigned int*)(0x42CA0064UL))
#define bFM3_ETHERNET_MAC0_BMR_MB              *((volatile unsigned int*)(0x42CA0068UL))
#define bFM3_ETHERNET_MAC0_BMR_TXPR            *((volatile unsigned int*)(0x42CA006CUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD0           *((volatile unsigned int*)(0x42CA0080UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD1           *((volatile unsigned int*)(0x42CA0084UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD2           *((volatile unsigned int*)(0x42CA0088UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD3           *((volatile unsigned int*)(0x42CA008CUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD4           *((volatile unsigned int*)(0x42CA0090UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD5           *((volatile unsigned int*)(0x42CA0094UL))
