AshKoi/Dwin/Dwin_Project/drivers/common/mb9bf218s.h
#define bFM3_ETHERNET_MAC0_TPDR_TPD6           *((volatile unsigned int*)(0x42CA0098UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD7           *((volatile unsigned int*)(0x42CA009CUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD8           *((volatile unsigned int*)(0x42CA00A0UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD9           *((volatile unsigned int*)(0x42CA00A4UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD10          *((volatile unsigned int*)(0x42CA00A8UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD11          *((volatile unsigned int*)(0x42CA00ACUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD12          *((volatile unsigned int*)(0x42CA00B0UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD13          *((volatile unsigned int*)(0x42CA00B4UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD14          *((volatile unsigned int*)(0x42CA00B8UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD15          *((volatile unsigned int*)(0x42CA00BCUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD16          *((volatile unsigned int*)(0x42CA00C0UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD17          *((volatile unsigned int*)(0x42CA00C4UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD18          *((volatile unsigned int*)(0x42CA00C8UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD19          *((volatile unsigned int*)(0x42CA00CCUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD20          *((volatile unsigned int*)(0x42CA00D0UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD21          *((volatile unsigned int*)(0x42CA00D4UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD22          *((volatile unsigned int*)(0x42CA00D8UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD23          *((volatile unsigned int*)(0x42CA00DCUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD24          *((volatile unsigned int*)(0x42CA00E0UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD25          *((volatile unsigned int*)(0x42CA00E4UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD26          *((volatile unsigned int*)(0x42CA00E8UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD27          *((volatile unsigned int*)(0x42CA00ECUL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD28          *((volatile unsigned int*)(0x42CA00F0UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD29          *((volatile unsigned int*)(0x42CA00F4UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD30          *((volatile unsigned int*)(0x42CA00F8UL))
#define bFM3_ETHERNET_MAC0_TPDR_TPD31          *((volatile unsigned int*)(0x42CA00FCUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD0           *((volatile unsigned int*)(0x42CA0100UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD1           *((volatile unsigned int*)(0x42CA0104UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD2           *((volatile unsigned int*)(0x42CA0108UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD3           *((volatile unsigned int*)(0x42CA010CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD4           *((volatile unsigned int*)(0x42CA0110UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD5           *((volatile unsigned int*)(0x42CA0114UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD6           *((volatile unsigned int*)(0x42CA0118UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD7           *((volatile unsigned int*)(0x42CA011CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD8           *((volatile unsigned int*)(0x42CA0120UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD9           *((volatile unsigned int*)(0x42CA0124UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD10          *((volatile unsigned int*)(0x42CA0128UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD11          *((volatile unsigned int*)(0x42CA012CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD12          *((volatile unsigned int*)(0x42CA0130UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD13          *((volatile unsigned int*)(0x42CA0134UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD14          *((volatile unsigned int*)(0x42CA0138UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD15          *((volatile unsigned int*)(0x42CA013CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD16          *((volatile unsigned int*)(0x42CA0140UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD17          *((volatile unsigned int*)(0x42CA0144UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD18          *((volatile unsigned int*)(0x42CA0148UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD19          *((volatile unsigned int*)(0x42CA014CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD20          *((volatile unsigned int*)(0x42CA0150UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD21          *((volatile unsigned int*)(0x42CA0154UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD22          *((volatile unsigned int*)(0x42CA0158UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD23          *((volatile unsigned int*)(0x42CA015CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD24          *((volatile unsigned int*)(0x42CA0160UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD25          *((volatile unsigned int*)(0x42CA0164UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD26          *((volatile unsigned int*)(0x42CA0168UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD27          *((volatile unsigned int*)(0x42CA016CUL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD28          *((volatile unsigned int*)(0x42CA0170UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD29          *((volatile unsigned int*)(0x42CA0174UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD30          *((volatile unsigned int*)(0x42CA0178UL))
#define bFM3_ETHERNET_MAC0_RPDR_RPD31          *((volatile unsigned int*)(0x42CA017CUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL2          *((volatile unsigned int*)(0x42CA0188UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL3          *((volatile unsigned int*)(0x42CA018CUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL4          *((volatile unsigned int*)(0x42CA0190UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL5          *((volatile unsigned int*)(0x42CA0194UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL6          *((volatile unsigned int*)(0x42CA0198UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL7          *((volatile unsigned int*)(0x42CA019CUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL8          *((volatile unsigned int*)(0x42CA01A0UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL9          *((volatile unsigned int*)(0x42CA01A4UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL10         *((volatile unsigned int*)(0x42CA01A8UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL11         *((volatile unsigned int*)(0x42CA01ACUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL12         *((volatile unsigned int*)(0x42CA01B0UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL13         *((volatile unsigned int*)(0x42CA01B4UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL14         *((volatile unsigned int*)(0x42CA01B8UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL15         *((volatile unsigned int*)(0x42CA01BCUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL16         *((volatile unsigned int*)(0x42CA01C0UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL17         *((volatile unsigned int*)(0x42CA01C4UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL18         *((volatile unsigned int*)(0x42CA01C8UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL19         *((volatile unsigned int*)(0x42CA01CCUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL20         *((volatile unsigned int*)(0x42CA01D0UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL21         *((volatile unsigned int*)(0x42CA01D4UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL22         *((volatile unsigned int*)(0x42CA01D8UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL23         *((volatile unsigned int*)(0x42CA01DCUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL24         *((volatile unsigned int*)(0x42CA01E0UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL25         *((volatile unsigned int*)(0x42CA01E4UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL26         *((volatile unsigned int*)(0x42CA01E8UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL27         *((volatile unsigned int*)(0x42CA01ECUL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL28         *((volatile unsigned int*)(0x42CA01F0UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL29         *((volatile unsigned int*)(0x42CA01F4UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL30         *((volatile unsigned int*)(0x42CA01F8UL))
#define bFM3_ETHERNET_MAC0_RDLAR_SRL31         *((volatile unsigned int*)(0x42CA01FCUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL2          *((volatile unsigned int*)(0x42CA0208UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL3          *((volatile unsigned int*)(0x42CA020CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL4          *((volatile unsigned int*)(0x42CA0210UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL5          *((volatile unsigned int*)(0x42CA0214UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL6          *((volatile unsigned int*)(0x42CA0218UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL7          *((volatile unsigned int*)(0x42CA021CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL8          *((volatile unsigned int*)(0x42CA0220UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL9          *((volatile unsigned int*)(0x42CA0224UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL10         *((volatile unsigned int*)(0x42CA0228UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL11         *((volatile unsigned int*)(0x42CA022CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL12         *((volatile unsigned int*)(0x42CA0230UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL13         *((volatile unsigned int*)(0x42CA0234UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL14         *((volatile unsigned int*)(0x42CA0238UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL15         *((volatile unsigned int*)(0x42CA023CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL16         *((volatile unsigned int*)(0x42CA0240UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL17         *((volatile unsigned int*)(0x42CA0244UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL18         *((volatile unsigned int*)(0x42CA0248UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL19         *((volatile unsigned int*)(0x42CA024CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL20         *((volatile unsigned int*)(0x42CA0250UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL21         *((volatile unsigned int*)(0x42CA0254UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL22         *((volatile unsigned int*)(0x42CA0258UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL23         *((volatile unsigned int*)(0x42CA025CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL24         *((volatile unsigned int*)(0x42CA0260UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL25         *((volatile unsigned int*)(0x42CA0264UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL26         *((volatile unsigned int*)(0x42CA0268UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL27         *((volatile unsigned int*)(0x42CA026CUL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL28         *((volatile unsigned int*)(0x42CA0270UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL29         *((volatile unsigned int*)(0x42CA0274UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL30         *((volatile unsigned int*)(0x42CA0278UL))
#define bFM3_ETHERNET_MAC0_TDLAR_STL31         *((volatile unsigned int*)(0x42CA027CUL))
#define bFM3_ETHERNET_MAC0_SR_TI               *((volatile unsigned int*)(0x42CA0280UL))
#define bFM3_ETHERNET_MAC0_SR_TPS              *((volatile unsigned int*)(0x42CA0284UL))
#define bFM3_ETHERNET_MAC0_SR_TU               *((volatile unsigned int*)(0x42CA0288UL))
#define bFM3_ETHERNET_MAC0_SR_TJT              *((volatile unsigned int*)(0x42CA028CUL))
#define bFM3_ETHERNET_MAC0_SR_OVF              *((volatile unsigned int*)(0x42CA0290UL))
#define bFM3_ETHERNET_MAC0_SR_UNF              *((volatile unsigned int*)(0x42CA0294UL))
#define bFM3_ETHERNET_MAC0_SR_RI               *((volatile unsigned int*)(0x42CA0298UL))
#define bFM3_ETHERNET_MAC0_SR_RU               *((volatile unsigned int*)(0x42CA029CUL))
#define bFM3_ETHERNET_MAC0_SR_RPS              *((volatile unsigned int*)(0x42CA02A0UL))
#define bFM3_ETHERNET_MAC0_SR_RWT              *((volatile unsigned int*)(0x42CA02A4UL))
#define bFM3_ETHERNET_MAC0_SR_ETI              *((volatile unsigned int*)(0x42CA02A8UL))
#define bFM3_ETHERNET_MAC0_SR_FBI              *((volatile unsigned int*)(0x42CA02B4UL))
#define bFM3_ETHERNET_MAC0_SR_ERI              *((volatile unsigned int*)(0x42CA02B8UL))
#define bFM3_ETHERNET_MAC0_SR_AIS              *((volatile unsigned int*)(0x42CA02BCUL))
#define bFM3_ETHERNET_MAC0_SR_NIS              *((volatile unsigned int*)(0x42CA02C0UL))
#define bFM3_ETHERNET_MAC0_SR_RS0              *((volatile unsigned int*)(0x42CA02C4UL))
#define bFM3_ETHERNET_MAC0_SR_RS1              *((volatile unsigned int*)(0x42CA02C8UL))
#define bFM3_ETHERNET_MAC0_SR_RS2              *((volatile unsigned int*)(0x42CA02CCUL))
#define bFM3_ETHERNET_MAC0_SR_TS0              *((volatile unsigned int*)(0x42CA02D0UL))
#define bFM3_ETHERNET_MAC0_SR_TS1              *((volatile unsigned int*)(0x42CA02D4UL))
#define bFM3_ETHERNET_MAC0_SR_TS2              *((volatile unsigned int*)(0x42CA02D8UL))
#define bFM3_ETHERNET_MAC0_SR_EB0              *((volatile unsigned int*)(0x42CA02DCUL))
#define bFM3_ETHERNET_MAC0_SR_EB1              *((volatile unsigned int*)(0x42CA02E0UL))
#define bFM3_ETHERNET_MAC0_SR_EB2              *((volatile unsigned int*)(0x42CA02E4UL))
#define bFM3_ETHERNET_MAC0_SR_GLI              *((volatile unsigned int*)(0x42CA02E8UL))
#define bFM3_ETHERNET_MAC0_SR_GMI              *((volatile unsigned int*)(0x42CA02ECUL))
#define bFM3_ETHERNET_MAC0_SR_GPI              *((volatile unsigned int*)(0x42CA02F0UL))
#define bFM3_ETHERNET_MAC0_SR_TTI              *((volatile unsigned int*)(0x42CA02F4UL))
#define bFM3_ETHERNET_MAC0_SR_GLPII            *((volatile unsigned int*)(0x42CA02F8UL))
#define bFM3_ETHERNET_MAC0_OMR_SR              *((volatile unsigned int*)(0x42CA0304UL))
#define bFM3_ETHERNET_MAC0_OMR_OSF             *((volatile unsigned int*)(0x42CA0308UL))
#define bFM3_ETHERNET_MAC0_OMR_RTC0            *((volatile unsigned int*)(0x42CA030CUL))
#define bFM3_ETHERNET_MAC0_OMR_RTC1            *((volatile unsigned int*)(0x42CA0310UL))
#define bFM3_ETHERNET_MAC0_OMR_FUF             *((volatile unsigned int*)(0x42CA0318UL))
#define bFM3_ETHERNET_MAC0_OMR_FEF             *((volatile unsigned int*)(0x42CA031CUL))
#define bFM3_ETHERNET_MAC0_OMR_ST              *((volatile unsigned int*)(0x42CA0334UL))
#define bFM3_ETHERNET_MAC0_OMR_TTC0            *((volatile unsigned int*)(0x42CA0338UL))
#define bFM3_ETHERNET_MAC0_OMR_TTC1            *((volatile unsigned int*)(0x42CA033CUL))
#define bFM3_ETHERNET_MAC0_OMR_TTC2            *((volatile unsigned int*)(0x42CA0340UL))
#define bFM3_ETHERNET_MAC0_OMR_FTF             *((volatile unsigned int*)(0x42CA0350UL))
#define bFM3_ETHERNET_MAC0_OMR_TSF             *((volatile unsigned int*)(0x42CA0354UL))
#define bFM3_ETHERNET_MAC0_OMR_DFF             *((volatile unsigned int*)(0x42CA0360UL))
#define bFM3_ETHERNET_MAC0_OMR_RSF             *((volatile unsigned int*)(0x42CA0364UL))
#define bFM3_ETHERNET_MAC0_OMR_DT              *((volatile unsigned int*)(0x42CA0368UL))
#define bFM3_ETHERNET_MAC0_IER_TIE             *((volatile unsigned int*)(0x42CA0380UL))
#define bFM3_ETHERNET_MAC0_IER_TSE             *((volatile unsigned int*)(0x42CA0384UL))
#define bFM3_ETHERNET_MAC0_IER_TUE             *((volatile unsigned int*)(0x42CA0388UL))
#define bFM3_ETHERNET_MAC0_IER_TJE             *((volatile unsigned int*)(0x42CA038CUL))
#define bFM3_ETHERNET_MAC0_IER_OVE             *((volatile unsigned int*)(0x42CA0390UL))
#define bFM3_ETHERNET_MAC0_IER_UNE             *((volatile unsigned int*)(0x42CA0394UL))
#define bFM3_ETHERNET_MAC0_IER_RIE             *((volatile unsigned int*)(0x42CA0398UL))
#define bFM3_ETHERNET_MAC0_IER_RUE             *((volatile unsigned int*)(0x42CA039CUL))
#define bFM3_ETHERNET_MAC0_IER_RSE             *((volatile unsigned int*)(0x42CA03A0UL))
#define bFM3_ETHERNET_MAC0_IER_RWE             *((volatile unsigned int*)(0x42CA03A4UL))
#define bFM3_ETHERNET_MAC0_IER_ETE             *((volatile unsigned int*)(0x42CA03A8UL))
#define bFM3_ETHERNET_MAC0_IER_FBE             *((volatile unsigned int*)(0x42CA03B4UL))
#define bFM3_ETHERNET_MAC0_IER_ERE             *((volatile unsigned int*)(0x42CA03B8UL))
#define bFM3_ETHERNET_MAC0_IER_AIE             *((volatile unsigned int*)(0x42CA03BCUL))
#define bFM3_ETHERNET_MAC0_IER_NIE             *((volatile unsigned int*)(0x42CA03C0UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH0        *((volatile unsigned int*)(0x42CA0400UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH1        *((volatile unsigned int*)(0x42CA0404UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH2        *((volatile unsigned int*)(0x42CA0408UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH3        *((volatile unsigned int*)(0x42CA040CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH4        *((volatile unsigned int*)(0x42CA0410UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH5        *((volatile unsigned int*)(0x42CA0414UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH6        *((volatile unsigned int*)(0x42CA0418UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH7        *((volatile unsigned int*)(0x42CA041CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH8        *((volatile unsigned int*)(0x42CA0420UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH9        *((volatile unsigned int*)(0x42CA0424UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH10       *((volatile unsigned int*)(0x42CA0428UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH11       *((volatile unsigned int*)(0x42CA042CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH12       *((volatile unsigned int*)(0x42CA0430UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH13       *((volatile unsigned int*)(0x42CA0434UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH14       *((volatile unsigned int*)(0x42CA0438UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFH15       *((volatile unsigned int*)(0x42CA043CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_ONMFH        *((volatile unsigned int*)(0x42CA0440UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF0        *((volatile unsigned int*)(0x42CA0444UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF1        *((volatile unsigned int*)(0x42CA0448UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF2        *((volatile unsigned int*)(0x42CA044CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF3        *((volatile unsigned int*)(0x42CA0450UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF4        *((volatile unsigned int*)(0x42CA0454UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF5        *((volatile unsigned int*)(0x42CA0458UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF6        *((volatile unsigned int*)(0x42CA045CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF7        *((volatile unsigned int*)(0x42CA0460UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF8        *((volatile unsigned int*)(0x42CA0464UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF9        *((volatile unsigned int*)(0x42CA0468UL))
#define bFM3_ETHERNET_MAC0_MFBOCR_NMFF10       *((volatile unsigned int*)(0x42CA046CUL))
#define bFM3_ETHERNET_MAC0_MFBOCR_ONMFF        *((volatile unsigned int*)(0x42CA0470UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT0         *((volatile unsigned int*)(0x42CA0480UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT1         *((volatile unsigned int*)(0x42CA0484UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT2         *((volatile unsigned int*)(0x42CA0488UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT3         *((volatile unsigned int*)(0x42CA048CUL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT4         *((volatile unsigned int*)(0x42CA0490UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT5         *((volatile unsigned int*)(0x42CA0494UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT6         *((volatile unsigned int*)(0x42CA0498UL))
#define bFM3_ETHERNET_MAC0_RIWTR_RIWT7         *((volatile unsigned int*)(0x42CA049CUL))
#define bFM3_ETHERNET_MAC0_AHBSR_AHBS          *((volatile unsigned int*)(0x42CA0580UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP0        *((volatile unsigned int*)(0x42CA0900UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP1        *((volatile unsigned int*)(0x42CA0904UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP2        *((volatile unsigned int*)(0x42CA0908UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP3        *((volatile unsigned int*)(0x42CA090CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP4        *((volatile unsigned int*)(0x42CA0910UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP5        *((volatile unsigned int*)(0x42CA0914UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP6        *((volatile unsigned int*)(0x42CA0918UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP7        *((volatile unsigned int*)(0x42CA091CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP8        *((volatile unsigned int*)(0x42CA0920UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP9        *((volatile unsigned int*)(0x42CA0924UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP10       *((volatile unsigned int*)(0x42CA0928UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP11       *((volatile unsigned int*)(0x42CA092CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP12       *((volatile unsigned int*)(0x42CA0930UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP13       *((volatile unsigned int*)(0x42CA0934UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP14       *((volatile unsigned int*)(0x42CA0938UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP15       *((volatile unsigned int*)(0x42CA093CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP16       *((volatile unsigned int*)(0x42CA0940UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP17       *((volatile unsigned int*)(0x42CA0944UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP18       *((volatile unsigned int*)(0x42CA0948UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP19       *((volatile unsigned int*)(0x42CA094CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP20       *((volatile unsigned int*)(0x42CA0950UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP21       *((volatile unsigned int*)(0x42CA0954UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP22       *((volatile unsigned int*)(0x42CA0958UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP23       *((volatile unsigned int*)(0x42CA095CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP24       *((volatile unsigned int*)(0x42CA0960UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP25       *((volatile unsigned int*)(0x42CA0964UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP26       *((volatile unsigned int*)(0x42CA0968UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP27       *((volatile unsigned int*)(0x42CA096CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP28       *((volatile unsigned int*)(0x42CA0970UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP29       *((volatile unsigned int*)(0x42CA0974UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP30       *((volatile unsigned int*)(0x42CA0978UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP31       *((volatile unsigned int*)(0x42CA097CUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP0        *((volatile unsigned int*)(0x42CA0980UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP1        *((volatile unsigned int*)(0x42CA0984UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP2        *((volatile unsigned int*)(0x42CA0988UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP3        *((volatile unsigned int*)(0x42CA098CUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP4        *((volatile unsigned int*)(0x42CA0990UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP5        *((volatile unsigned int*)(0x42CA0994UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP6        *((volatile unsigned int*)(0x42CA0998UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP7        *((volatile unsigned int*)(0x42CA099CUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP8        *((volatile unsigned int*)(0x42CA09A0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP9        *((volatile unsigned int*)(0x42CA09A4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP10       *((volatile unsigned int*)(0x42CA09A8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP11       *((volatile unsigned int*)(0x42CA09ACUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP12       *((volatile unsigned int*)(0x42CA09B0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP13       *((volatile unsigned int*)(0x42CA09B4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP14       *((volatile unsigned int*)(0x42CA09B8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP15       *((volatile unsigned int*)(0x42CA09BCUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP16       *((volatile unsigned int*)(0x42CA09C0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP17       *((volatile unsigned int*)(0x42CA09C4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP18       *((volatile unsigned int*)(0x42CA09C8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP19       *((volatile unsigned int*)(0x42CA09CCUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP20       *((volatile unsigned int*)(0x42CA09D0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP21       *((volatile unsigned int*)(0x42CA09D4UL))
